[{"title": "5 Common Excuses Keeping You From Breaking Into the Tech Field - Codeup", "content": "\nJust a few months before starting at Codeup in the Redwood cohort, I was sitting in the football stadium at the University of Colorado at Boulder, pondering what I would do after graduation. The commencement speaker that year was Kate Fagan, a sports reporter and commentator at ESPN. In her speech, something she said stuck out to me: “Try replacing ‘should’ with ‘want’ and, as frequently as you are able, make decisions with that rubric. Life is best when your ‘should’ and your ‘want’ are aligned.” Sitting there in that stadium, I realized that I knew exactly what I should be doing after graduating, which was applying to attend graduate school for the next five years. But the actual truth was, I didn’t know what I truly wanted. Did I really want to jump into something for five years that I wasn’t completely sure about? \nWith this in mind I moved to San Antonio after graduation, mostly to be closer to my family. One night at the dinner table, my brother-in-law mentioned several eye-catching billboards around town promoting a local coding bootcamp named Codeup. I had dabbled a bit in coding when I was in college, so my interest was immediately piqued. However, there were doubts nagging at the back of my mind. Am I even capable enough to attend an intensive coding bootcamp like this? I’m not really a super logical person… Am I cut out for this? etc, etc. Despite having a ton of reservations about my capabilities and the usefulness of attending a boot camp, I decided to take a leap of faith. And just a year-and-a-half later, I celebrated my one year as a software developer at Armor in Richardson, TX. In some ways, it feels like a dream. The hard work I put in, the days and nights of impassioned coding, pushing through all the excuses… and finally landing a dream job?! It’s a colorful blur. \nSo that’s why in this post, I want to address five common excuses that may be keeping you from considering a career in technology. At the end of the day, it doesn’t really make sense to let your fears and nagging doubts keep you from the job of your dreams.\n1. “I’m not cut out for a career in tech”\n\nThis was one of the primary fears at the forefront of my mind when thinking about doing a complete shift to a technology career. And, as I went through Codeup, I heard this many times from my peers. To be honest, it doesn’t ever fully go away. There are days even now at work where I think I’m in over my head and that I don’t belong there (Imposter Syndrome, anyone?). This fear completely disregards the fact that I’m already doing it. The truth is, it isn’t always easy. Technology is constantly changing, creating new problems and forcing those within the field to continuously find new solutions. At my company, even our most senior developers are learning something new every day. We all have our doubts sometimes, but those self-limiting beliefs shouldn’t keep you from pursuing anything you set your mind to. \n2. “I wouldn’t fit in with engineers”\n\nLet me ask you something. What does a veteran, electrical technician, and college music teacher have in common? Well, there was at least one of each in my cohort at Codeup, and all of them excelled and went on to become software developers. Other characters in my cohort included a stay-at-home-mom, barista, marketing professional, and a chef. All of these, however, are just arbitrary labels. None of these people told themselves “I’m just going to be a barista forever, because that’s who I am” or “My personality only suits being in a teacher, so I’m not going to try something different.” The reality is, our self-concept is always constantly shifting. There was such a colorful diversity of backgrounds, personalities, and skill sets at Codeup, proving that there’s no one type or mold of individual that can pursue a technology career. \n3. “I don’t want to work alone all day staring at a computer screen”\n\nThere are days where indeed this is the case for me, just “heads down coding”, but more often than not my days are filled with collaboration and communication with my teammates. When someone runs into a problem they don’t have the knowledge to solve, they track down someone who does. When a few of us are working in the same codebase, we make sure to frequently communicate to make sure we’re not stepping on each other’s toes. On top of that, we get to be a part of producing the product, providing feedback and suggestions. There are very few days where I just sit at my desk all day, boring holes into my computer screen. Although my experience may certainly be atypical, the main point I’m trying to make is that there is a large range of positions and cultures within the technology field. There are also other roles within the technology field beyond coding and data analytics, such as evangelists and solutions consultants. Both of these have lots of interaction with people and clients! Don’t be afraid to try a few different things until you find your fit.\n4. “I don’t have enough experience”\n\nMost of us at Codeup did not come in with prior experience in coding. The great thing about coding bootcamps is that they typically take you from 0 to 100 in a condensed period of time. They guide you through the entire process, allowing you to maximize your success, with everything from technical skills, networking, portfolio-building, and resume review. Even with bootcamps aside, there is a plethora of both paid and free resources online that give you the ability to learn a lot of the preliminary skills you would need. There are communities (e.g. Chingu) with the sole purpose of learning and building projects in new technologies. Experience can be gained, so seek out those resources. They’re only a few keystrokes away. \nOne thing to note about the technology field is that it’s becoming more and more heavily based on experience and not your formal education. Many companies will see the value in someone who has practical experience. The reality is that many companies are shifting towards seeking out individuals that can come in and hit the ground running with practical know-how instead of purely theoretical education. \n5. “I’m not tech savvy enough.”\n\nAlthough basic computer skills are necessary for success, it’s probably not as much as you think. And like I mentioned above, being able to excel in this field is all about embracing change and learning to learn. You may think you’re not tech savvy because you always have issues with your radio or you can’t get your apps to work right or you get frustrated with your computer software for not doing what you want it to – all of these things are valid struggles. Trust me, I’ve been there. The reality is this: Many of these skills can be learned.\n\nAs you look into pursuing a career in the technology field, don’t let these thought patterns keep you from getting where you want to be. Instead, ask yourself the real questions: Why do I want to do this? What kind of lifestyle do I see for myself? What am I passionate about? Excuses are excuses, not truths about you and your life. Set a vision and relentlessly pursue it, letting all these limiting beliefs slide off of you. They don’t have to define your journey.\n\n\nJoyce Ling is a software developer at a cloud security company based in Richardson, TX. In her free time, she sings in a women’s chorus, rock climbs, plays guitar, and currently runs an organization to bring queer women together in the Dallas/Ft. Worth metroplex. \nFollow her on Instagram @ironicsushi or read more of her work at The Luscious Word.\n"}, {"title": "Why San Antonio Has More Than Tacos To Offer - Codeup", "content": "\nBefore moving to San Antonio, I was slightly apprehensive. Knowing little to nothing about the city, I didn’t know what to expect. All that had filtered down from the collective consciousness to my perception of the city was the obvious tourist attractions such as the Riverwalk, Alamo, and amazing Tex Mex. After spending a little under a year there, I came to fall in love with this city for reasons beyond what tourists can see in a weekend. The experience of its vibrant and proud Latino culture, flourishing art scene, and emphasis on community have left an indelible mark upon my life. \nAll this aside, a huge part of my experience in San Antonio was attending Codeup, a coding boot camp that allowed me to have the skills needed to make a complete career shift and also an insider’s look into San Antonio’s flourishing tech community. For those of you that have never had a local’s perspective into the technology layer of San Antonio, I’m here to explain five reasons you should consider beginning a data science career here.\n\n   1. San Antonio is a tech hotspot.\nAlthough San Antonio is usually overshadowed by its northern neighbor Austin, it is actually a humble but bustling tech hotspot according to Inc., a weekly business magazine. Especially as Austin’s infrastructure struggles to support its rapid expansion and population growth, corporations and talent have begun to siphon off to San Antonio, which is only an hour south. Cost-of-living is much lower compared to Austin and is an attractive option for anyone starting out in entry-level data science. Additionally, a 2018 CBRE report names San Antonio in the top 50 US markets for tech talent, and is rapidly rising. On top of that, San Antonio ranked first among small tech markets in millennial population growth, with 12.5 percent between 2011 and 2016. Brookings found even greater growth, more than 14 percent, among millennials in a January report. Where the talent goes, corporations will follow. \n  \n    2. Big corporations in San Antonio are hiring for data science roles. \nPeople may not realize it, but San Antonio is home to lots of large corporations such as USAA, HEB, Accenture, Hulu, iHeartMedia, Booz Allen — the list goes on. A quick Google search for data science jobs in San Antonio will pull up over a hundred active openings, all from corporations like the ones listed above. Additionally, SA Works conducted an analysis of over 30 business and thousands of job posts and has projected a higher growth in local tech jobs in San Antonio than the national average. Many of the corporations named above were found to be actively hiring for these positions. Data Science is also considered one of the best jobs in America for 2019, which makes it especially attractive with San Antonio’s affordable cost of living.\n\n    3. San Antonio has a tight-knit tech community.\nA tight-knit community means that it is much more accessible for individuals to find resources that will aid them towards their goals, i.e. to become a data scientist. With even just a few months in San Antonio, I was able to see how welcoming and supporting the tech community is. With tech conferences, meetups, workshops, hackathons, and startup competitions galore, the community is truly thriving. The hub of a lot of this activity is Geekdom, a coworking space that serves as the central place for technology nerds to gather. Much of this community has a united vision to see technology flourish in San Antonio. For example, Tech Bloc was an organization created to advocate for policies that attract technology companies and talent to San Antonio. Even Codeup itself was created in order to produce more tech talent in San Antonio and drive growth. With so many determined and passionate technology stakeholders in San Antonio, its growth is inevitable! \n\n    4. San Antonio’s cloud and security sector are well-renowned. \nWhen I say “well-renowned”, it’s not because the majority of people talk about it. The thing about security is that… it’s typically discreet. However, San Antonio is actually the home of dozens of security startups, and some of the most prominent ones are nowhere near household names except perhaps for those that are familiar with the industry. Many of these companies would do well to not draw attention to themselves due to the nature of the work. In conjunction, the University of Texas at San Antonio has three separate cybersecurity centers, and one of them is the top-ranked program in the nation. In general, cybersecurity spending is growing globally, and this will, in turn, benefit the tech growth in San Antonio.  \n\n    5. The city is invested in growing technologically.  \nGrowing up, I would hear my parents tell me that you need to look at someone’s wallet to know who they truly are. That is, it’s important to know how someone spends their money. One way to tell that San Antonio cares about technology is seeing how the city invests in technology initiatives. For example, there’s WiFi in eight of the city parks, solar-powered smartphone charging attached to benches, and even drones assisting in search and rescue operations. Additionally, the city and Bexar County have addressed the tech gap by budgeting up to 300,000 dollars to create a role for a chief talent and recruitment officer (CTRO). This individual, along with the local nonprofit Tech Bloc which administers the position, has a job that is two-fold: bringing in outside tech talent and matching local talent to organizations. \n\nIn many ways, San Antonio is a city that many people seem to underestimate. I showed up without high hopes, dreading the Texas heat and bad drivers. However, it’s a place that I ended up finding some of my closest friends, along with a diverse community and thriving tech industry. Plus, it doesn’t hurt that it’s dubbed the Taco capital of the US. \n\n—\n\nJoyce Ling is a software developer at a cloud security company based in Richardson, TX. In her free time, she sings in a women’s chorus, rock climbs, plays guitar, and currently runs an organization to bring queer women together in the Dallas/Ft. Worth metroplex. \nFollow her on Instagram @ironicsushi or read more of her work at The Luscious Word.\n"}, {"title": "Everyday Encounters with Data Science - Codeup", "content": "\nYou come home from work, tired to the bone and groaning as you realize you forgot to prep dinner tonight. So, what do you do? You plop down on the couch, whip out your phone and Google “restaurants near me”. You scroll down the list of places to eat and take into account a variety of factors: how high the ratings are, how many people have rated that restaurant, how far it is from you, whether or not it’s busy at that moment, the keywords mentioned in reviews, how long it’s open… the list goes on. You carefully bookmark each prospective restaurant so you can find it later. All of a sudden, you notice that without your knowledge, three hours have slipped by. You realize with a feeling of dread in your stomach that nearly all the restaurants around you are closed… and you head over to the nearest Whataburger in defeat. \nA week later, life finds you in the same supine position on the couch, scrolling through restaurants. This time, though, you realize there’s a little compatibility rating next to each restaurant listing. As you scroll, you stumble upon a sushi restaurant that apparently is 90% compatible with your preferences. Without hesitation, you rush there with glee to find that it is everything you could have hoped for! Wow! Data science saves the day!\n\nThis very relatable experience is a prime example of how many of us have experienced data science in our lives without realizing it. Let’s take a quick moment to analyze how data science played the protagonist in this story. It is important to note that data science is a broad subject that encompasses a variety of things, including first gathering and shaping data, storing that data, then analyzing and visually presenting that data. \n \nHow Google Does It\nBefore we can start analyzing data, Google data scientists must first be able to gather information about everything from restaurant locations, hours, pricing, customer reviews, etc. Next, this massive influx of data must be efficiently manipulated and organized so it can quickly be retrieved, Marie Kondo style. Data scientists are then able to take and analyze this data and visually translate it into something that makes sense, such as the graph that displays the busiest hours at the restaurant, or the tidy list of restaurants you see in the app that is ordered by distance from you.\n\nA simple action such as filtering by “Open Now” or “Price” requires a tight coordination of all of these steps in order to actually produce the output expected by the user. Amazingly, Google Maps is able to do this analysis real-time to constantly change its results based on your current location. Not only that, it is simultaneously analyzing every single person’s GPS data real-time. This allows them to generate components like the graph of how busy an establishment is at the moment.\n \nGoogle Maps, A Man’s Best Friend\nAnother important factor in data science is using analysis to drive predictions (Read more here about the difference between data analytics and data science). For example, in calculating compatibility ratings, the program takes into account Google location history, search history, types of cuisine/restaurants you typically visit or avoid, whether you’ve saved/rated/visited a place or somewhere similar, or simply data that a user inputs about their dietary preferences. It also allows for constant feedback from the user if a compatibility rating seems off, with a “Not Right?” link attached to every rating. In other words, this rating is a prediction of how much you would like a restaurant based on your past history and behavior. \nSo how exactly has Google mastered this compatibility rating? Most likely, data scientists at Google have created algorithms to take the pieces of information listed above to produce a prediction. Essentially, it’s a way for a computer program to act more human. For example, think about how you recommend a show to your best friend. Most likely, you know your friend’s personality and history of shows that they’ve enjoyed, so you generally know what kind of show they may like watching. \nSimilarly, data scientists can use algorithms and statistical models to write code that continuously “learns” to make better predictions, creating an adaptable learning machine. With machine learning and artificial intelligence, Google is able to generate friendly human-like recommendations for over a billion people every single month, which is probably better than what your best friend could do.\n\n\nWhen Robots Take Over the World\nAs the data science field continues to progress and we get closer and closer to true artificial intelligence, we will most likely see the effects of that trickle down into the parts of our everyday life that we hardly consider. We already trust the algorithms and generated recommendations that suggest where or when to eat. Eventually, even something as vital as a life-altering surgery will be dictated by recommendations generated by algorithms for doctors. Understanding and learning about data science will become more significant as it gradually becomes enmeshed with society in ways we may not even be able to fully comprehend. Read more here about Codeup’s 18-week Data Science program which covers most of the topics mentioned in this article, including data visualization, analytics, and machine learning. \n—\n\nJoyce Ling is a software developer at a cloud security company based in Richardson, TX. In her free time, she sings in a women’s chorus, rock climbs, plays guitar, and currently runs an organization to bring queer women together in the Dallas/Ft. Worth metroplex. \nFollow her on Instagram @ironicsushi or read more of her work at The Luscious Word.\n"}, {"title": "Finding the Perfect Coding Bootcamp Fit for Me - Codeup", "content": "\n \n\n\nBy Marcella Munter\nI looked at Codeup for 2 years before I finally made the decision to apply. As a requirement for my Math degree, I took an Intro to Java class. I enjoyed it so much and was tempted to switch majors. However, I was a semester away from graduation and decided not to. Coding was still something I wanted to do so I tried some online courses. \nThe online classes were satisfactory, but it made me realize two things: 1) I didn’t know what I needed to be learning and 2) whatever I did learn, I needed to be in a classroom setting to learn it. I heard about Codeup and other coding bootcamps and added myself to Codeup’s mailing list. However, both the price and the thought of having to quit my job scared me from ever applying. I found a cheaper coding school and attended one of their coding workshops, but didn’t like the way the workshop was run. The instructors only gave us lines of code to write with little theory behind it. That combined with poor organization in general made me realize that was not the place for me. I went back to Codeup’s website and read about their curriculum. I liked how theory as well as practical usage was taught. I was also liked seeing how much help was available to students from instructors and student fellows. However, the biggest question still on my mind was, “Will I get a job afterwards?”\nI learned that the curriculum at Codeup is developed with input from tech companies, which means that Codeup is teaching important skills that employers are actually looking for. Incidentally, the curriculum changed a bit a few months before I started due to employers’ requests. An added bonus on the job front was an in-house liaison between students and employers. Codeup’s Director of Product, Stephen Salas, has connections with several companies and he always know which ones are looking for developers fresh out of school. I decided to take a chance and applied even though I was still worried about the financial part of it. When I got accepted, I found out that there are many scholarships and programs to help ease the financial burden. I qualified for some of these even though I thought I wouldn’t. Many more scholarships and grants have been added since I left Codeup thus lowering the barrier to attend. I graduated in May 2018 and am currently working as a developer specializing in data extraction and transformation. I love what I’m doing now. My only regret is that I didn’t do this sooner.\n\n\n\n\n \n\n\n\n\n\n \n\n \n\n \n\n\n \n\n \n\nJoin Us_ \n\nWe're excited to launch our new Codeup newsletter, which highlights some interesting blog posts, things in the know, and upcoming events. We promise to keep things interesting and engaging - twice a month. \n\nGeneral_ \n\nStudents_ \n\nInfo_ \n\nLegal_ \n\n \n\n600 Navarro St. #350, San Antonio, Texas \n\n \n\n \n\n \n\n|   info@codeup.com \n\n   |   210 - 802 - 7289   \n\n \n\nComplaint Policy \n\nPrivacy Center\n\n\nApply Now \n\nBlog \n\nWhy Codeup \n\nFAQ \n\nContact \n\nOur Programs \n\nFinancials \n\nWeb Development \n\nData Science \n\nHome \n\nAbout Codeup \n\nEmployers \n\nAlumni \n\nWe promise to keep things interesting and engaging - twice a month. \n\nCopyright All Rights Reserved © 2019 Codeup | Website Designed by Tribu Digital Marketing \n\n\n \nvar htmlDiv = document.getElementById(\"rs-plugin-settings-inline-css\"); var htmlDivCss=\"\";\r\n\t\t\t\tif(htmlDiv) {\r\n\t\t\t\t\thtmlDiv.innerHTML = htmlDiv.innerHTML + htmlDivCss;\r\n\t\t\t\t}else{\r\n\t\t\t\t\tvar htmlDiv = document.createElement(\"div\");\r\n\t\t\t\t\thtmlDiv.innerHTML = \"<style>\" + htmlDivCss + \"</style>\";\r\n\t\t\t\t\tdocument.getElementsByTagName(\"head\")[0].appendChild(htmlDiv.childNodes[0]);\r\n\t\t\t\t}\r\n\t\t\t\n\r\nif (setREVStartSize!==undefined) setREVStartSize(\r\n\t{c: '#rev_slider_1_1', responsiveLevels: [1240,1024,778,480], gridwidth: [1240,1024,778,480], gridheight: [575,500,400,720], sliderLayout: 'fullwidth'});\r\n\t\t\t\r\nvar revapi1,\r\n\ttpj;\t\r\n(function() {\t\t\t\r\n\tif (!/loaded|interactive|complete/.test(document.readyState)) document.addEventListener(\"DOMContentLoaded\",onLoad); else onLoad();\t\r\n\tfunction onLoad() {\t\t\t\t\r\n\t\tif (tpj===undefined) { tpj = jQuery; if(\"off\" == \"on\") tpj.noConflict();}\r\n\tif(tpj(\"#rev_slider_1_1\").revolution == undefined){\n\t\trevslider_showDoubleJqueryError(\"#rev_slider_1_1\");\n\t}else{\n\t\trevapi1 = tpj(\"#rev_slider_1_1\").show().revolution({\n\t\t\tsliderType:\"hero\",\n\t\t\tjsFileLocation:\"//codeup.com/wp-content/plugins/revslider/public/assets/js/\",\n\t\t\tsliderLayout:\"fullwidth\",\n\t\t\tdottedOverlay:\"none\",\n\t\t\tdelay:9000,\n\t\t\tresponsiveLevels:[1240,1024,778,480],\n\t\t\tvisibilityLevels:[1240,1024,778,480],\n\t\t\tgridwidth:[1240,1024,778,480],\n\t\t\tgridheight:[575,500,400,720],\n\t\t\tlazyType:\"none\",\n\t\t\tshadow:0,\n\t\t\tspinner:\"spinner0\",\n\t\t\tautoHeight:\"off\",\n\t\t\tdisableProgressBar:\"on\",\n\t\t\thideThumbsOnMobile:\"off\",\n\t\t\thideSliderAtLimit:0,\n\t\t\thideCaptionAtLimit:0,\n\t\t\thideAllCaptionAtLilmit:0,\n\t\t\tdebugMode:false,\n\t\t\tfallbacks: {\n\t\t\t\tsimplifyAll:\"off\",\n\t\t\t\tdisableFocusListener:false,\n\t\t\t}\n\t\t});\n\t}; /* END OF revapi call */\n\t\n }; /* END OF ON LOAD FUNCTION */\r\n}()); /* END OF WRAPPING FUNCTION */\r\n\n\n"}, {"title": "Codeup Student Check In: Month 3 - Codeup", "content": "\nPhoto by Jon Garcia\nCodeup welcomed the Wrangell cohort on July 23. With the start of this cohort, we launched a new blog series: the Codeup Student Check In. We’ll interview a student over the course of the 4.5 months to see how things are progressing from first impressions all the way to graduation. Thus, welcome to the Codeup Student Check In: Month 3!\n \n \nCodeup: How has your experience been at Codeup so far? \nWrangell Student: I’ve had a great experience so far. Everything has been what I imagined and more. I have learned things in a short amount of time that otherwise would’ve taken me months upon months to learn. The people here are some of the kindest and most supportive people that I’ve met in a long time, and I’m happy to have this experience in my life. \nC: Describe what you’re learning right now. Is it hard/fun/challenging? \nS: We’ve just started our capstone project which is the final hurrah of our Codeup experience. We are in the planning stages and it’s honestly a little overwhelming due to the sheer amount of information we’re communicating to our teammates and because of the volume of work that’s going to be done over this next week or two. Nonetheless, I am excited by the challenge and I know that our final project is going to be something that I will be really proud of and really happy to have been a part of. I’m excited to see how it will all pan out. \nC: How has the learning process/information gathering been?\nS: I love doing research and the focus of my research has shifted from solely academic to a balance between academic and professional. I am still researching new technologies as well as doing further research into the current curriculum but now I am also doing research into potential companies I’d like to work with. I’m interested in their mission and if their goals align with mine, both short and long term.\nC:What has been the most memorable part of this month?\nS:The most memorable part of this month has been actually shopping for new interview outfits, looking at myself in the mirror, and seeing a young professional. This has been one of my long-term goals and it’s a great experience seeing it come to fruition.\nC:How do you feel your skill level compares to last month? \nS: I think my skill levels are increasing each month. Now that we are going into full stack applications I can finally see the cumulative success of my time here.\nC: How have the instructors and staff been helpful? Have you started working with the placement side of Codeup? If so, can you elaborate on that? \nS: I am grateful for the mock interview process with the instructors. It’s really helpful to have your instructors grade you on your performance and prep you for real world interviews. These instructors all have some sort of practical experience and firsthand knowledge of the professional world. Their experience and advice is invaluable.\nC: Did you learn anything new at Codeup that you weren’t expecting? \nS: I wasn’t expecting to learn as many people skills as I did. I thought this was strictly a technical school and this really came as a surprise. I have really learned how to network and how to talk to people that I otherwise would have been scared to talk to. I’ve learned that people are people, just humans, and improving conversational skills to talk with them is valuable. Learning the value of a human connection in the professional world is a very exciting thing.\nC: Have you been interviewing for jobs? What has that been like? If not, do you know what type of role you are looking for? (Ie. Developer, Q/A, Tech sales, Tech Ed, etc)\nS: I’ve had a few interviews this weekend and they have been very exciting and stressful. Having interviews back to back is both a blessing and a curse. It’s important to destress at home and really be aware of your emotions and reactions to stress. Time management is another big challenge. How much time do I put into studying versus interview prep? How much time can I dedicate to other life roles and be a good girlfriend, good daughter, and good pet owner while still fulfilling my role as a student and job seeker? These challenges are tough to overcome, and this is where emotional awareness can really help.\nC: If you can give one piece of advice to any prospective students, what would it be? \nS: Really do your research. Know what you’re getting into. You can’t go into anything blind! Get as much knowledge as you can so you can thoroughly prepare for and enjoy this journey. A great plan will save you a lot of suffering in the long run.\n\n\n\n\n \n\n\n\n\n\n \n\n \n\n \n\n\n \n\n \n\nJoin Us_ \n\nWe're excited to launch our new Codeup newsletter, which highlights some interesting blog posts, things in the know, and upcoming events. We promise to keep things interesting and engaging - twice a month. \n\nGeneral_ \n\nStudents_ \n\nInfo_ \n\nLegal_ \n\n \n\n600 Navarro St. #350, San Antonio, Texas \n\n \n\n \n\n \n\n|   info@codeup.com \n\n   |   210 - 802 - 7289   \n\n \n\nComplaint Policy \n\nPrivacy Center\n\n\nApply Now \n\nBlog \n\nWhy Codeup \n\nFAQ \n\nContact \n\nOur Programs \n\nFinancials \n\nWeb Development \n\nData Science \n\nHome \n\nAbout Codeup \n\nEmployers \n\nAlumni \n\nWe promise to keep things interesting and engaging - twice a month. \n\nCopyright All Rights Reserved © 2019 Codeup | Website Designed by Tribu Digital Marketing \n\n\n \nvar htmlDiv = document.getElementById(\"rs-plugin-settings-inline-css\"); var htmlDivCss=\"\";\r\n\t\t\t\tif(htmlDiv) {\r\n\t\t\t\t\thtmlDiv.innerHTML = htmlDiv.innerHTML + htmlDivCss;\r\n\t\t\t\t}else{\r\n\t\t\t\t\tvar htmlDiv = document.createElement(\"div\");\r\n\t\t\t\t\thtmlDiv.innerHTML = \"<style>\" + htmlDivCss + \"</style>\";\r\n\t\t\t\t\tdocument.getElementsByTagName(\"head\")[0].appendChild(htmlDiv.childNodes[0]);\r\n\t\t\t\t}\r\n\t\t\t\n\r\nif (setREVStartSize!==undefined) setREVStartSize(\r\n\t{c: '#rev_slider_1_1', responsiveLevels: [1240,1024,778,480], gridwidth: [1240,1024,778,480], gridheight: [575,500,400,720], sliderLayout: 'fullwidth'});\r\n\t\t\t\r\nvar revapi1,\r\n\ttpj;\t\r\n(function() {\t\t\t\r\n\tif (!/loaded|interactive|complete/.test(document.readyState)) document.addEventListener(\"DOMContentLoaded\",onLoad); else onLoad();\t\r\n\tfunction onLoad() {\t\t\t\t\r\n\t\tif (tpj===undefined) { tpj = jQuery; if(\"off\" == \"on\") tpj.noConflict();}\r\n\tif(tpj(\"#rev_slider_1_1\").revolution == undefined){\n\t\trevslider_showDoubleJqueryError(\"#rev_slider_1_1\");\n\t}else{\n\t\trevapi1 = tpj(\"#rev_slider_1_1\").show().revolution({\n\t\t\tsliderType:\"hero\",\n\t\t\tjsFileLocation:\"//codeup.com/wp-content/plugins/revslider/public/assets/js/\",\n\t\t\tsliderLayout:\"fullwidth\",\n\t\t\tdottedOverlay:\"none\",\n\t\t\tdelay:9000,\n\t\t\tresponsiveLevels:[1240,1024,778,480],\n\t\t\tvisibilityLevels:[1240,1024,778,480],\n\t\t\tgridwidth:[1240,1024,778,480],\n\t\t\tgridheight:[575,500,400,720],\n\t\t\tlazyType:\"none\",\n\t\t\tshadow:0,\n\t\t\tspinner:\"spinner0\",\n\t\t\tautoHeight:\"off\",\n\t\t\tdisableProgressBar:\"on\",\n\t\t\thideThumbsOnMobile:\"off\",\n\t\t\thideSliderAtLimit:0,\n\t\t\thideCaptionAtLimit:0,\n\t\t\thideAllCaptionAtLilmit:0,\n\t\t\tdebugMode:false,\n\t\t\tfallbacks: {\n\t\t\t\tsimplifyAll:\"off\",\n\t\t\t\tdisableFocusListener:false,\n\t\t\t}\n\t\t});\n\t}; /* END OF revapi call */\n\t\n }; /* END OF ON LOAD FUNCTION */\r\n}()); /* END OF WRAPPING FUNCTION */\r\n\n\n"}, {"title": "From Styling Hair to Stying Interfaces - Codeup", "content": "\nBy Sukari Schutzman\n\nI grew up loving technology. I still remember thinking that my grandmothers’ flip phone in 1995 was the coolest thing I had ever seen. As a child, I took all my electronic toys apart, because I was curious what was inside. So you can say, I always yearned for a career in tech.\nMy name is Sukari Schutzman. I don’t take myself too seriously, I’m always laughing, and trying to share positive energy, but most importantly I am a software developer.\nWhen I got my cosmetology license, I was passionate about doing hair. I wanted to learn how to be better, and how to perfect my craft. In many ways, I see a lot of parallels in cosmetology, and in software development. Drawing those parallels kept me strong in the program and reminded me to never give up. I remembered when I was in cosmetology school, or when I was in the salon and I was stuck on something, I always asked for help. In software development and at Codeup, the same rings true.\nI had always driven by the billboards on I-10 on my way into San Antonio and was ALWAYS confused. “Software Developer? Why is ‘Retail Manager’ crossed out? What is that?”, I always wondered. But I always continued to drive on and thought nothing of it when I reached my destination.\nI decided development was for me and wanted to transition into it and learn how to code, as I had been exposed to it for a while. I knew self-study would not work for me. I needed to be in a classroom and knew I needed to be in front of an instructor. But most importantly, I needed a job ASAP because I needed to support myself and my child.\nWhen I arrived at Codeup and went on the tour I was amazed. I knew this would be the place for me, and it was going to be where I knew my life would change. I was going to be walking out of one door and into another. And I wasn’t going to look back.\nWhen I found out that I had got in, I was so happy that my hard work paid off and I knew it was just the beginning of what was to come. I looked forward to the start date and marked it on my calendar. I also quit my job, which was much needed because salon life was stressful enough, let alone learning a new skill.\nThe next few months were filled with triumphs and failures, which is normal in any career. No one is born good at everything, it takes practice and determination (I totally had to repeat that to myself every single day at Codeup. Thanks Ryan!). Sometimes it felt like two steps back, but I was determined to make it to Demo Day and present my Capstone.\nWith the help of Codeup staff, I felt setup to succeed at Demo Day. But most of all, I felt prepared for my new career.\nDemo Day finally came! Our project got the most compliments on the visual interface, which I worked hard on, and helped us stand out amongst our classmates. I had a few interviews set up for within a week after Demo Day and landed my first job. At this point, I was in awe. Everything I worked hard for had finally came to fruition. And most of all, I didn’t have to work weekends unless I wanted to.\n\nThere’s nothing wrong with being hair stylist, absolutely not! However, it just wasn’t for me anymore. Thanks to Codeup, my life is so different now.\nAnd for that, I am eternally grateful.\n\n\n\n\n \n\n\n\n\n\n \n\n \n\n \n\n\n \n\n \n\nJoin Us_ \n\nWe're excited to launch our new Codeup newsletter, which highlights some interesting blog posts, things in the know, and upcoming events. We promise to keep things interesting and engaging - twice a month. \n\nGeneral_ \n\nStudents_ \n\nInfo_ \n\nLegal_ \n\n \n\n600 Navarro St. #350, San Antonio, Texas \n\n \n\n \n\n \n\n|   info@codeup.com \n\n   |   210 - 802 - 7289   \n\n \n\nComplaint Policy \n\nPrivacy Center\n\n\nApply Now \n\nBlog \n\nWhy Codeup \n\nFAQ \n\nContact \n\nOur Programs \n\nFinancials \n\nWeb Development \n\nData Science \n\nHome \n\nAbout Codeup \n\nEmployers \n\nAlumni \n\nWe promise to keep things interesting and engaging - twice a month. \n\nCopyright All Rights Reserved © 2019 Codeup | Website Designed by Tribu Digital Marketing \n\n\n \nvar htmlDiv = document.getElementById(\"rs-plugin-settings-inline-css\"); var htmlDivCss=\"\";\r\n\t\t\t\tif(htmlDiv) {\r\n\t\t\t\t\thtmlDiv.innerHTML = htmlDiv.innerHTML + htmlDivCss;\r\n\t\t\t\t}else{\r\n\t\t\t\t\tvar htmlDiv = document.createElement(\"div\");\r\n\t\t\t\t\thtmlDiv.innerHTML = \"<style>\" + htmlDivCss + \"</style>\";\r\n\t\t\t\t\tdocument.getElementsByTagName(\"head\")[0].appendChild(htmlDiv.childNodes[0]);\r\n\t\t\t\t}\r\n\t\t\t\n\r\nif (setREVStartSize!==undefined) setREVStartSize(\r\n\t{c: '#rev_slider_1_1', responsiveLevels: [1240,1024,778,480], gridwidth: [1240,1024,778,480], gridheight: [575,500,400,720], sliderLayout: 'fullwidth'});\r\n\t\t\t\r\nvar revapi1,\r\n\ttpj;\t\r\n(function() {\t\t\t\r\n\tif (!/loaded|interactive|complete/.test(document.readyState)) document.addEventListener(\"DOMContentLoaded\",onLoad); else onLoad();\t\r\n\tfunction onLoad() {\t\t\t\t\r\n\t\tif (tpj===undefined) { tpj = jQuery; if(\"off\" == \"on\") tpj.noConflict();}\r\n\tif(tpj(\"#rev_slider_1_1\").revolution == undefined){\n\t\trevslider_showDoubleJqueryError(\"#rev_slider_1_1\");\n\t}else{\n\t\trevapi1 = tpj(\"#rev_slider_1_1\").show().revolution({\n\t\t\tsliderType:\"hero\",\n\t\t\tjsFileLocation:\"//codeup.com/wp-content/plugins/revslider/public/assets/js/\",\n\t\t\tsliderLayout:\"fullwidth\",\n\t\t\tdottedOverlay:\"none\",\n\t\t\tdelay:9000,\n\t\t\tresponsiveLevels:[1240,1024,778,480],\n\t\t\tvisibilityLevels:[1240,1024,778,480],\n\t\t\tgridwidth:[1240,1024,778,480],\n\t\t\tgridheight:[575,500,400,720],\n\t\t\tlazyType:\"none\",\n\t\t\tshadow:0,\n\t\t\tspinner:\"spinner0\",\n\t\t\tautoHeight:\"off\",\n\t\t\tdisableProgressBar:\"on\",\n\t\t\thideThumbsOnMobile:\"off\",\n\t\t\thideSliderAtLimit:0,\n\t\t\thideCaptionAtLimit:0,\n\t\t\thideAllCaptionAtLilmit:0,\n\t\t\tdebugMode:false,\n\t\t\tfallbacks: {\n\t\t\t\tsimplifyAll:\"off\",\n\t\t\t\tdisableFocusListener:false,\n\t\t\t}\n\t\t});\n\t}; /* END OF revapi call */\n\t\n }; /* END OF ON LOAD FUNCTION */\r\n}()); /* END OF WRAPPING FUNCTION */\r\n\n\n"}, {"title": "From Cooking Steaks To Cooking Code - Codeup", "content": "\nby Alexander Bous\n\nGrowing up\nIt would be an understatement to say that the bar of expectations were set high as the youngest of 4 to immigrant parents, who were also mechanical engineers. Eldest: Entrepreneur with several successful businesses; Second: Contract Law Lawyer; Third: Doctor of Neonatal Genetics; Fourth (Me): cooked since I was 15. Although the decision to make a career of cooking didn’t hit me for a few years, I had known that I did not want to follow the footsteps of my parents or siblings.\nCooking\nAt the age of 19, I decided that I wanted to attend college at the prestigious Culinary Institute of America (CIA). Before I could finalize my decision, I knew I had to tell my parents. They reacted just as I thought they would. “What?! NO, NEVER! Never in my life did I ever think my son would become a cook.” Our family comes from a culture where there are three acceptable career paths: Doctors, Lawyers, and Engineers. Coming from a family where I already had a sibling fulfilling each of those roles, I felt that I had nothing to prove to anyone except myself. I ended up attending CIA and working in the industry for 15 years. Having held every role in a kitchen and marriage, including being a parent, I decided it was time to put my ego aside, think about what’s best for my family, and transition careers.\nThe Most Important Thing\nEarly on in my cooking career, I had a mentor that drilled a simple phrase into my head: “The most important thing in life is to figure out what is most important.” This simple saying spoke very loudly to me; how can you work towards a goal if you don’t know what the goal is? Every task I would work on in life would ring those words in my head; So what was most important to me? “A happy family and nothing else” is what I have defined as what is most important. Now it’s time to figure out how to get there.\nThe First Step: Codeup Open House\nAfter spending too much time on autopilot, it was then that I realized the only thing keeping me in the restaurant industry was that it was the only thing I really knew. I needed to break the mold to be able to achieve the most important thing. Having always been computer savvy and a self-proclaimed problem solver, I soon realized that I was better with computers than I thought. It seemed to come more naturally to me than others, which was when I realized I needed to find a career that would allow me to use my skills in computers. There was only one clear answer for me, and that was Codeup. I spent time at their open house, and I was sold. Not only were they kind and caring individuals, but also extremely smart and talented developers and teachers. It seemed like the right answer.\nThe Second Step: “Good”\nAfter getting through the admissions process and getting accepted, I decided to make the best of my decision to attend and set a plan of action to take in as much as possible. I made note cards, studied ahead, built random projects I found online, and ran code kata’s everyday. Sounds impressive, but I can assure you, there was much failure involved. If I was struggling, “Good” would tend to be my response because with failure comes the opportunity to get better; it meant that there was something that I needed to work on. As the difficulty level strengthened, so did the number of “Good” moments. There were moments when doubt and worry went through my mind as well. I was worried that I had made the wrong move.  I turned to my classmates with the plea for help, they responded similarly as well. “What a relief,” I thought. It was good to know that I wasn’t the only one in class struggling because it made me realized I tricked myself into thinking that I was couldn’t do it. \nFinding a Job with Only Cooking Experience\nAfter graduating from Codeup and being fully aware of my imposter syndrome, I could not shake the thought of why someone would hire me. I would have to constantly remind myself that, with the skills I had from my previous work experiences and the new skills I learned over the past 18 weeks, I was more than capable. With the help of the Director of Product, Stephen Salas, I was able to find a job within one week of graduating.\nGoal Achieved: Now What? Maintain and Gain Skills\nI got the knowledge, got the job, and got the work/life balance. Now what? Now it’s time to continue to learn and advance with your newly learned skills. One thing I realized after going through the Codeup program was that there are a lot of similarities between learning to code and learning to cook. At first, basic skills require a lot of effort and struggle, but eventually they become second nature. After the basics are understood and the muscle memory is built, then comes the never ending list of more advanced skills. When people ask me what the best part of Codeup is, I tend to respond simply with, “they taught me how to learn”. I look at new projects that I am given and when I have no idea where to start, I say “Good”, another opportunity to get better.\n\n\n\n\n \n\n\n\n\n\n \n\n \n\n \n\n\n \n\n \n\nJoin Us_ \n\nWe're excited to launch our new Codeup newsletter, which highlights some interesting blog posts, things in the know, and upcoming events. We promise to keep things interesting and engaging - twice a month. \n\nGeneral_ \n\nStudents_ \n\nInfo_ \n\nLegal_ \n\n \n\n600 Navarro St. #350, San Antonio, Texas \n\n \n\n \n\n \n\n|   info@codeup.com \n\n   |   210 - 802 - 7289   \n\n \n\nComplaint Policy \n\nPrivacy Center\n\n\nApply Now \n\nBlog \n\nWhy Codeup \n\nFAQ \n\nContact \n\nOur Programs \n\nFinancials \n\nWeb Development \n\nData Science \n\nHome \n\nAbout Codeup \n\nEmployers \n\nAlumni \n\nWe promise to keep things interesting and engaging - twice a month. \n\nCopyright All Rights Reserved © 2019 Codeup | Website Designed by Tribu Digital Marketing \n\n\n \nvar htmlDiv = document.getElementById(\"rs-plugin-settings-inline-css\"); var htmlDivCss=\"\";\r\n\t\t\t\tif(htmlDiv) {\r\n\t\t\t\t\thtmlDiv.innerHTML = htmlDiv.innerHTML + htmlDivCss;\r\n\t\t\t\t}else{\r\n\t\t\t\t\tvar htmlDiv = document.createElement(\"div\");\r\n\t\t\t\t\thtmlDiv.innerHTML = \"<style>\" + htmlDivCss + \"</style>\";\r\n\t\t\t\t\tdocument.getElementsByTagName(\"head\")[0].appendChild(htmlDiv.childNodes[0]);\r\n\t\t\t\t}\r\n\t\t\t\n\r\nif (setREVStartSize!==undefined) setREVStartSize(\r\n\t{c: '#rev_slider_1_1', responsiveLevels: [1240,1024,778,480], gridwidth: [1240,1024,778,480], gridheight: [575,500,400,720], sliderLayout: 'fullwidth'});\r\n\t\t\t\r\nvar revapi1,\r\n\ttpj;\t\r\n(function() {\t\t\t\r\n\tif (!/loaded|interactive|complete/.test(document.readyState)) document.addEventListener(\"DOMContentLoaded\",onLoad); else onLoad();\t\r\n\tfunction onLoad() {\t\t\t\t\r\n\t\tif (tpj===undefined) { tpj = jQuery; if(\"off\" == \"on\") tpj.noConflict();}\r\n\tif(tpj(\"#rev_slider_1_1\").revolution == undefined){\n\t\trevslider_showDoubleJqueryError(\"#rev_slider_1_1\");\n\t}else{\n\t\trevapi1 = tpj(\"#rev_slider_1_1\").show().revolution({\n\t\t\tsliderType:\"hero\",\n\t\t\tjsFileLocation:\"//codeup.com/wp-content/plugins/revslider/public/assets/js/\",\n\t\t\tsliderLayout:\"fullwidth\",\n\t\t\tdottedOverlay:\"none\",\n\t\t\tdelay:9000,\n\t\t\tresponsiveLevels:[1240,1024,778,480],\n\t\t\tvisibilityLevels:[1240,1024,778,480],\n\t\t\tgridwidth:[1240,1024,778,480],\n\t\t\tgridheight:[575,500,400,720],\n\t\t\tlazyType:\"none\",\n\t\t\tshadow:0,\n\t\t\tspinner:\"spinner0\",\n\t\t\tautoHeight:\"off\",\n\t\t\tdisableProgressBar:\"on\",\n\t\t\thideThumbsOnMobile:\"off\",\n\t\t\thideSliderAtLimit:0,\n\t\t\thideCaptionAtLimit:0,\n\t\t\thideAllCaptionAtLilmit:0,\n\t\t\tdebugMode:false,\n\t\t\tfallbacks: {\n\t\t\t\tsimplifyAll:\"off\",\n\t\t\t\tdisableFocusListener:false,\n\t\t\t}\n\t\t});\n\t}; /* END OF revapi call */\n\t\n }; /* END OF ON LOAD FUNCTION */\r\n}()); /* END OF WRAPPING FUNCTION */\r\n\n\n"}, {"title": "Don't Be Scared of Coding - Codeup", "content": "\n \nWhen you’re scared to run your code, and it works the first try (Halloween style)!\n\nWhen I first started as a developer I ran into some scary scenarios. My code was very error prone and I created some functions that I was expecting a string as the output but I got an object. It was very frustrating and I wasn’t even sure I would be able to understand software development let alone have to go and fix my code. My nightmare scenario was to be hired on as a developer and then have to troubleshoot, a.k.a. debug, some other developers code😱😱😱. I think most junior developers have had shared my fear at some point in their career. I was taught to heavily rely upon outputting your results to the console whether its good or bad to help troubleshoot.\nIn this post I will do my best to help calm the fears of my fellow junior developers with helpful debugging tools and hopefully transition away from relying upon console.log(). While my focus will be on JavaScript these tools can easily be translated to other languages.\nLogging output to the console isn’t always helpful\nFor the longest time console.log() was my go-to when I needed to debug JavaScript code. It was my developer friend who told me what was wrong with my code and was never judgemental . I will admit that there are few scenarios where it is “OK” to output the results of a function to the console.\nExcept more recently, I have found using console.log() to be less useful when debugging and only making things worse by expecting a good outcome and then disappointing me. Like an expired $5 Amazon Gift Card (Thanks, grandma). Take for example, this gem:\nObject doesn't support property or method 'from'\nThat lovely error is from IE 11 which does not support Array.from(node List) prototype without a shim/poly fill that is available here.\nHowever, I have come to find out that logging errors to the console is either inefficient or completely irrelevant to what may actually be causing the problem in your code. I will admit that some errors are easily resolved by reading the output of the error message and fixing the typo or following the instructions of the error message to help resolve the problem.\n\n\n\n\n\n\nSo in the image above we are shown a node item which has so many properties that you might not be aware of, which renders console.log useless. You have to know ahead of time what value or specific attribute you are trying to output which requires some abstract thinking or referencing documentation to identify this property. Now using the console.log will output all the entire properties of the node item but its an unnecessary step to add in this line of code while you debug and then go back and remove the line of code.\n\n“You don’t know what you don’t know” -Bill Parcel (Head Coach New England Patriots)\n\nThe error the console outputs might provide you with the location of the error, but you may not know why are you getting the error in the first place. Maybe you’re passing the incorrect value to the function or you are working with event handling and bubbling events.\nEither way, chances are that you aren’t thinking about that one property that is actually passing the value your expecting because you weren’t aware of how to call it or pass it along.\nI’m going to piggy back off of Mozilla’s Debug Playground as an example for why you shouldn’t use the console and instead use the Browsers built-in debugger or equally as helpful is an IDE’s built-in debugger.\ncough cough Visual Studio Code cough cough\n Now, whether you prefer Chrome over FireFox is a whole different can-o-worms.\n\n\n\n\n\n\nIDE Tools and Online REPLs\n\n“Hey man, I’m a back-end developer and so I need to console.log”\n-Fictional Backend Developer\n\nSo maybe you don’t have a fully fleshed out web form or you’re trying to get data from some API or JSON file. You need to see data from the function you’re writing or better yet you want to test a function that someone else wrote without having to clone the entire project. Using console.log() seems like the go to. In fact, around ¾ of Node.js developers report using it (in 2017) for finding errors in their applications.\nI’m here to tell you of a few better ways to debug your code.\nIDE Tools\nThe first tool I have come to love and trust is one made by a company called Wallaby.js\nQuokkaJS (Integrated Scratchpad for JavaScript)\n\n\n\n\n\n\nWith this plug-in you can write your code and get immediate results. No need to throw in a bunch of console.log’s in your function and check the output. It has an integration for VSCode (💖💖💖 ), JetBrainsIDE and Atom. I personally have purchased a pro license but for the most part the community version will work just fine.\nSonarLint ( Like spellcheck but for your code)\n\n\n\n\n\n\nI think all developers should have some sort of code linting tool added into their IDE. This helps review your code in real-time and “should” prevent you from compiling or running code with errors in it. I’ve chosen SonarLint because its given me better results than ES6 linter or some other linting tools that i’ve tried. I’m not saying its the best or that the others don’t work but I haven’t had to configure much other than just installing the extension.\nScratchpad (Built-in Browser Javascript sandbox)\nMozilla also offers a feature in their DevTools that allows you to write, run, and view the output of JavaScript code that can interact with the current web page or not.\nREPLs\nI have a background in .NET development and I have fallen in love with Microsoft’s F# Language along with the fsharp community. While going through the documentation I was introduced to a new term, REPL.\nREPL stands for: Read-Evaluate-Print-Loop.\n“ In a REPL, the user enters one or more expressions (rather than an entire compilation unit) and the REPL evaluates them and displays the results.” -Wikipedia\nSo I thought, this was cool and I used my Googliness™️ to search for an online version or service and so I came upon THIS.\n\nREPL.IT\n\nI don’t need to console.log my output or assign the function to var result = greeting() and then console.log(greeting(\"Jessica\")) . I just write my function, invoke it and BOOM! I get the output without the need of console.log() .\n\nRepl.it supports many languages!\n\n\nI can even create a Repl, write some code and share the link with someone that can give me feedback, Brilliant!\nCoincidentally, Repl.it uses Monaco, which is the same Editor that VSCode uses.\nFinally, for the developer on a budget (including myself) most popular IDEs have a built-in debugger that works the same was as the debugger in Chrome or Firefox.\nI’ve kindly added links to How-Tos: For a few IDEs (don’t get mad if your IDE is not listed, I’m looking at you Atom IDE community).\nDebugging in VSCode \nDebugging in JetBrains IntelliJ\nDebugging in Visual Studio\nFinal Thoughts\nSo why have I gone through the long winded trouble of explaining / trying to convince you why you should wean yourself off of using the console.log and embrace debugging tools? How was this suppose to make you feel better / more confident in writing code?\nThe short answer is: I believe having more information and proper tools “should” make coding, and for that matter debugging, less daunting / scary.\nUse of widely available, open-source debugging tools is key to be more familiar with software development and to grow as a developer.\n\n\n\n\n \n\n\n\n\n\n \n\n \n\n \n\n\n \n\n \n\nJoin Us_ \n\nWe're excited to launch our new Codeup newsletter, which highlights some interesting blog posts, things in the know, and upcoming events. We promise to keep things interesting and engaging - twice a month. \n\nGeneral_ \n\nStudents_ \n\nInfo_ \n\nLegal_ \n\n \n\n600 Navarro St. #350, San Antonio, Texas \n\n \n\n \n\n \n\n|   info@codeup.com \n\n   |   210 - 802 - 7289   \n\n \n\nComplaint Policy \n\nPrivacy Center\n\n\nApply Now \n\nBlog \n\nWhy Codeup \n\nFAQ \n\nContact \n\nOur Programs \n\nFinancials \n\nWeb Development \n\nData Science \n\nHome \n\nAbout Codeup \n\nEmployers \n\nAlumni \n\nWe promise to keep things interesting and engaging - twice a month. \n\nCopyright All Rights Reserved © 2019 Codeup | Website Designed by Tribu Digital Marketing \n\n\n \nvar htmlDiv = document.getElementById(\"rs-plugin-settings-inline-css\"); var htmlDivCss=\"\";\r\n\t\t\t\tif(htmlDiv) {\r\n\t\t\t\t\thtmlDiv.innerHTML = htmlDiv.innerHTML + htmlDivCss;\r\n\t\t\t\t}else{\r\n\t\t\t\t\tvar htmlDiv = document.createElement(\"div\");\r\n\t\t\t\t\thtmlDiv.innerHTML = \"<style>\" + htmlDivCss + \"</style>\";\r\n\t\t\t\t\tdocument.getElementsByTagName(\"head\")[0].appendChild(htmlDiv.childNodes[0]);\r\n\t\t\t\t}\r\n\t\t\t\n\r\nif (setREVStartSize!==undefined) setREVStartSize(\r\n\t{c: '#rev_slider_1_1', responsiveLevels: [1240,1024,778,480], gridwidth: [1240,1024,778,480], gridheight: [575,500,400,720], sliderLayout: 'fullwidth'});\r\n\t\t\t\r\nvar revapi1,\r\n\ttpj;\t\r\n(function() {\t\t\t\r\n\tif (!/loaded|interactive|complete/.test(document.readyState)) document.addEventListener(\"DOMContentLoaded\",onLoad); else onLoad();\t\r\n\tfunction onLoad() {\t\t\t\t\r\n\t\tif (tpj===undefined) { tpj = jQuery; if(\"off\" == \"on\") tpj.noConflict();}\r\n\tif(tpj(\"#rev_slider_1_1\").revolution == undefined){\n\t\trevslider_showDoubleJqueryError(\"#rev_slider_1_1\");\n\t}else{\n\t\trevapi1 = tpj(\"#rev_slider_1_1\").show().revolution({\n\t\t\tsliderType:\"hero\",\n\t\t\tjsFileLocation:\"//codeup.com/wp-content/plugins/revslider/public/assets/js/\",\n\t\t\tsliderLayout:\"fullwidth\",\n\t\t\tdottedOverlay:\"none\",\n\t\t\tdelay:9000,\n\t\t\tresponsiveLevels:[1240,1024,778,480],\n\t\t\tvisibilityLevels:[1240,1024,778,480],\n\t\t\tgridwidth:[1240,1024,778,480],\n\t\t\tgridheight:[575,500,400,720],\n\t\t\tlazyType:\"none\",\n\t\t\tshadow:0,\n\t\t\tspinner:\"spinner0\",\n\t\t\tautoHeight:\"off\",\n\t\t\tdisableProgressBar:\"on\",\n\t\t\thideThumbsOnMobile:\"off\",\n\t\t\thideSliderAtLimit:0,\n\t\t\thideCaptionAtLimit:0,\n\t\t\thideAllCaptionAtLilmit:0,\n\t\t\tdebugMode:false,\n\t\t\tfallbacks: {\n\t\t\t\tsimplifyAll:\"off\",\n\t\t\t\tdisableFocusListener:false,\n\t\t\t}\n\t\t});\n\t}; /* END OF revapi call */\n\t\n }; /* END OF ON LOAD FUNCTION */\r\n}()); /* END OF WRAPPING FUNCTION */\r\n\n\n\n\n"}, {"title": "Debugging with Codey the Rubber Duck - Codeup", "content": "\nBy Jennifer Walker\n\nI first encountered rubber duck debugging while attending Codeup. Each student had a duck at their seat on the first day of our 18 ½ week advanced full stack web development boot camp. The expression of each duck varied, but they all stared quietly and blankly at us as we took in our surroundings with excitement and anticipation. At the time, I had no idea what it was for or why we needed that bath time friend. Now I do.\n \n\n \n \n \n \n \n \n \nPart of what I love about programming is the problem-solving. However, in the attempt to figure out a software solution the developer very often can get tunnel vision – stuck on solving a problem the same wrong way or just get stumped with no real direction. This is where rubber duck debugging is the most useful. It originated from a book called “The Pragmatic Programmer” by Andrew Hunt and David Thomas.\nRubber duck debugging is simple. It includes taking the problem you are trying to solve and explaining it out loud to the rubber duck. This may seem silly because most of us have not talked to inanimate objects since we were kids. However, by doing this it forces a developer to think in a different way and to look at an issue under a microscope. Talking out loud activates a different part of the human brain, which very often helps the developer solve a problem without ever talking to another person. It keeps us from wasting our own time and the time of others when the solution is right at our fingertips.\nI have experienced this phenomenon myself when I try to explain aspects of programming to people who are not programmers. It forces me to think of programming in a different way. I have to lose the acronyms, and just speak plain English to a person who isn’t such an avid techie like myself. When I do that I walk away with new knowledge and a refreshed passion for what I have been discussing.\nPhoto: Photos By Marvin Pfeiffer / Staff Photographer\nI also learned later that the rubber duck is the official mascot for Codeup. His name is Codey and he has a special meaning to me beyond just rubber duck debugging. I began to sketch him on the first day of class. Over time he began to express my struggles and triumphs while learning to code. He came alive for me and became a student of Codeup alongside me during my time there. If I had a bad day, he totally understood because he was in the fire with me. If I struggled to understand a concept, he got that too and listened while I talked to him about what I was trying to do. Now, as a proud graduate of Codeup working as a software developer at a fantastic company, I keep Codey with me. He is in my car and at my desk at work. He also sits on my desk at home – waiting patiently to hear my struggles and what I am trying to solve for that day.\nIf you do not have a rubber duck for debugging, I suggest you go out and get one!\n"}, {"title": "From the Service Industry to Software Development - Codeup", "content": "\nBy Randi Mays\n\nFor many teenagers, the path to self-reliance starts in one of two places: a restaurant or retail store. Until it’s time to begin a professional career, you’re working that part-time job stocking shelves, helping irate customers with expired coupons or prepping for the dinner rush. I’d venture to say I’m one of the very few who was sad to leave that lifestyle behind.\nI worked in the food service and retail industries for 10 years before I attended Codeup. I took great pride in my work every day; I couldn’t go home until everything was near perfect: my work area spotless, the shelves neatly stocked and everything ready for the next shift. When it came time to leave the service industry and move on to professional work, I was initially reluctant. I had found great personal fulfillment and success in customer service. Why would I want to leave? \nI have big dreams. Of course I want to travel the world, spending my vacations in exotic destinations, trying new foods, seeing centuries-old architecture, and making lasting memories. But more importantly, I wanted to work for a company with a more widespread mission than gastronomic satisfaction. I wanted to work alongside people with a passion for their work that ran far deeper than a paycheck.\nAfter graduating from Codeup in September 2016, I began working for USAA as a software developer and I can tell you–the company is no stranger to giving. Each employee receives company paid volunteer hours and I used some of mine to volunteer at the San Antonio Food Bank among dozens of other USAA employees. Last year when Hurricane Harvey hit, USAA was quick to organize several volunteer sessions at their home campus to prepare food and other basic necessities to be delivered to people in need. They even have a system where I can automatically deduct a specified amount from my paycheck to give to charitable causes I am passionate about. I have heard story after story about their representatives on the phone going above and beyond their duties to serve members in combat zones and at home. I can’t enumerate here all of the reasons I admire USAA for its community involvement and caring, but I’m sure I’ve made my point.\nThere are times I look back on my experience in food service and retail nostalgically, remembering how I excelled in those positions and enjoyed the repetitive work. Then I come back to the present and remember how big an impact my employer makes serving the military community and their families, and how many lives are changed by the work I do with my team. I find great personal satisfaction and pride in my work every day, and I am just getting started.\n"}, {"title": "Codeup Student Check In: Month 2 - Codeup", "content": "\n \n\nCodeup welcomed our newest cohort, the Wrangell cohort, on July 23. With the start of this cohort, we are launching a new blog series: the Codeup Student Check In. We’ll interview a student over the course of the 4.5 months to see how things are progressing from first impressions all the way to graduation. Thus, welcome to the Codeup Student Check In: Month 2!\nWe took the time to sit down with our Wrangell student to see how they’ve been doing so far!\nCodeup: Describe what you’re learning right now. Is it hard/fun/challenging? \nWrangell Student: In this section of the curriculum we are learning about the basics of Java and the building blocks that make up the language. This language is more verbose than previous material, and one of the hardest parts is understanding the instructions and translating them to code. \nC: How has the learning process/information gathering been?\nS: A wide variety of resources are available. In addition to the curriculum, I utilize the Head First Java book and the Oracle documentation. Another challenge is combining the knowledge from all these resources into one.\nC: How do you feel your skill level compares to last month? \nS: Comparing my skill level now with that of last month is no contest. Everyone around me is improving as well and I am excited to see my classmates skill levels growing. Our skills are improving exponentially!\nC: How have the instructors and staff been helpful?\nS: The instructors hold study hall before class and after to give us extra help. They’re constantly posting resources in our slack channel and encouraging us to ask questions. They have no problem going back to review material or clarify any questions we have. At the same time, they encourage our learning. They don’t give us the answer if it’s obvious or an easily searchable question.\nC: Share a fun experience you had at Codeup!\nOur great staff gave us some very cool thermoses. I’m a diehard sticker fan. I immediately ordered coding and anime related stickers for this thermos and they’re going straight on the thermos the moment they come in!\nC: What has been the most memorable part of this month and has anything exciting happened?\nS: Codeup expanded onto the 6th floor of the Vogue building, so we’re coding in a totally different environment. It’s full of natural light, which makes me very happy. I personally love heights so it’s great to look out the windows while taking a break from coding.\nSomething exciting that happened was that I got my first star! Instructors give us stars for asking good questions. I’m the type of person who needs to google the answer first before asking something. I wouldn’t want to ask something that is easily available on the internet. However, Java is very challenging, and I just needed to ask questions and I got a star! Super exciting!\n \n"}, {"title": "Codeup’s Data Science Career Accelerator is Here! - Codeup", "content": "\nThe rumors are true! The time has arrived. Codeup has officially opened applications to our new Data Science career accelerator, with only 25 seats available! This immersive program is one of a kind in San Antonio, and will help you land a job in Glassdoor’s #1 Best Job in America.\nData Science is a method of providing actionable intelligence from data. The data revolution has hit San Antonio, resulting in an explosion in Data Scientist positions across companies like USAA, Accenture, Booz Allen Hamilton, and HEB. We’ve even seen UTSA invest $70 M for a Cybersecurity Center and School of Data Science. We built a program to specifically meet the growing demands of this industry.\nOur program will be 18 weeks long, full-time, hands-on, and project-based. Our curriculum development and instruction is led by Senior Data Scientist, Maggie Giust, who has worked at HEB, Capital Group, and Rackspace, along with input from dozens of practitioners and hiring partners. Students will work with real data sets, realistic problems, and the entire data science pipeline from collection to deployment. They will receive professional development training in resume writing, interviewing, and continuing education to prepare for a smooth transition to the workforce.\nWe focus on applied data science for immediate impact and ROI in a business, which is how we can back it all up with a 6 month tuition refund guarantee – just like our existing Web Dev program. We’re focusing on Data Science with Python, SQL, and ML, covered in 14 modules: 1) Fundamentals; 2) Applied statistics; 3) SQL; 4) Python; 5) Supervised machine learning – regression; 6) Supervised machine learning – classification; 7) Unsupervised machine learning – clustering; 8) Time series analysis; 9) Anomaly detection; 10) Natural language processing; 11) Distributed machine learning; 12) Advanced topics (deep learning, NoSQL, cloud deployment, etc.); 13) Storytelling with data; and 14) Domain expertise development.\nApplications are now open for Codeup’s first Data Science cohort, which will start class on February 4, 2019. Hurry – there are only 25 seats available! To further our mission of cultivating inclusive growth, scholarships will be available to women, minorities, LGBTQIA+ individuals, veterans, first responders, and people relocating to San Antonio.\nIf you want to learn about joining our program or hiring our graduates, email datascience@codeup.com!\n"}, {"title": "From a Recent College Grad to Software Developer - Codeup", "content": "\n\n\n\n\n\n\n \nI take pride in my bachelor’s degree. Starting my computing career at Trinity University has proven to be extremely important; all the hours spent on algorithm design, data structures, logic are all essential in what I’m doing now. However, it is not an uncommon idea that what colleges teach can sometimes be at an offset to industry demands. I experienced this significant gap between employer expectations and my computing skill-set post college, and with the I-need-a-job-to-get-experience-to-work-for-a-job-that-requires-experience catch that most college graduates experience the first few years of leaving academia, I found myself struggling to find employment. The first year of leaving my university was a humbling yet soul-crushing experience. Why is it that I’ve pursued a degree directly related to such a hungry market for software developers, but I am unable to find a job? Among what seemed like an endless stream of interviews in which I partook, I began to notice a trend – I lacked full stack development experience with relevant programming languages that are currently in demand. Turns out, having the theoretical knowledge isn’t enough for most employers in the market. The industry of software development has evolved throughout the years of its existence, and with its evolution came new programming languages that better suit the needs of its users and the customers it will eventually serve. Ultimately, logical thinking did not trump most self-taught HTML, CSS, Javascript developers that fill the market with highly innovative ideas and projects.\nAs a Trinity graduate who still lived in San Antonio after graduating, I learned more about Codeup from peers who contributed to the curriculum and program’s growth. Some of my classmates in my department also attended the program and found great opportunities within the industry upon graduating the program. At first, I was skeptical of the value Codeup could bring to someone like me who already had experience in programming, albeit in languages that weren’t exactly in demand. But, being unemployed and discouraged for seemingly an eternity, I decided to give it a go.\nThe program was an introduction to programming, which is very different from my experience in college. Since I was verbose in the structure and characteristics of software development, it was easily digestible. The curriculum consisted of introductions to different programming languages, and most importantly, showed me how everything pieced together to form working and aesthetically pleasing products that definitely had the potential to be client facing projects that serve the public. It was an eye-opening experience for me: seeing and experiencing web development with relevant technologies like MVC, ES6, and the Spring Framework. As most of the course material were quickly grasped by my existing mode of thinking, I spent most of my time on the assignments, perfecting them and pushing myself to create difficult effects or programs. The instructors were all extremely helpful and understanding of my background, and were even nice enough to provide me with bonus assignments to push what I’ve learned to its limits.\nI never would have guessed that Codeup would benefit me in the way it did. Within a week of graduating, I found a job as a Salesforce Developer at a consulting company here in San Antonio. Together with the knowledge I’ve obtained from my degree, I have put everything I learned at Codeup to use: creating real products used by thousands of real users. I wouldn’t be here without the experience I had, not just with the curriculum, but with the excellent career placement staff at Codeup. As cliché as it may sound, the benefits I’ve gotten from the program that acted as supplements to my degree don’t fall far from being life-changing, and I would encourage those who have experienced the same struggles as me in this competitive market to give it a go.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"title": "5 Things Codeup Doesn’t Tell You - Codeup", "content": "\nI remember during my first day of Codeup I began to doubt my ability to overcome the challenges that lay ahead. I soon learned that what I was experiencing was “impostor syndrome.” Jason Straughan, Codeup’s CEO, introduced us to this phenomenon that same day. Thanks to his kind advice I was able to identify, and overcome my doubts. Codeup shared many valuable lessons with me, but some lessons were taught through exposure outside of the Vogue building. If you decide to enroll at Codeup, you will find yourself learning many things outside the classroom. I realized through my own journey that there are things Codeup didn’t tell me. So, I’ve narrowed it down to the 5 main things I had to learn on my own as a newly placed software developer.\nYou Need to be Multilingual\n\nYou need to be adaptable and willing to open your ears to all ideas. They say the best way to learn a different language is through practice. In most of our professional and non-professional lives, relationships will have an assigned lingo to properly cater to that relationship. Furthermore, professional groups and organizations like projectQUEST, H-E-B, and Codeup have their own kind of language. These languages are used to identify and recognize individuals of that group or organization. It is important to keep this in mind before you start ANY application process, or start working with new people.\nEven though I did not have a college degree, I still had an interest in developing coding skills. I understood early on in my application process that I was in control of my outcome. I assumed determination contained the key to my success, and soon found myself being referred to ProjectQUEST for financial assistance.I would have never known about ProjectQUEST if the Codeup staff had not offered this vital information. The dedication and support offered by these organizations helped me through the multiple application processes. If you plan to visit projectQUEST or Workforce Solutions to inquire about their grants, make sure you’re determined to learn their language, and earn the money. If you have the right amount of determination you can find the proper channels fueling San Antonio’s STEM ecosystem through a simple Google search. Determination is one of the common denominators all Codeup graduates share, and if you too share this similarity, check out the scholarships offered by Codeup.\nPeople want jobs, but not everyone wants to work.\n\nvia GIPHY\nCodeup’s mission statement is the following, “At Codeup, we focus on two things: you and your success. Find a job within six months of graduation, or get 50% of your tuition returned.” Let me assure you they deliver in service,  content, and in career guidance. However, the staff cannot force you to either study the curriculum or develop programming skills for you. There are people that come ready to overcome adversity, then there are the few who expect to be fed morning tacos with a silver spoon. If you’re seriously considering Codeup, you need to prepare yourself to manage the beautiful chaos of assignments, interviews, and presentations.\nMy high school soccer coach had a saying, “Do you think Ronaldo is going to parachute from a helicopter and score for you?” We never expected Ronaldo at our high school practices but that was our coach handing down some of his kind wisdom. He used this as a tactic to build the team up before the start of our shooting drills. Ronaldo is a world star player who plays at a professional level so what coach Ramos was really trying to say was, “Work hard if you want the goal. Don’t expect someone to come and score for you!” You need to have a sense of responsibility before embarking on your own journey and launching your career.\nHave a servant’s heart.\nSome lessons weren’t coming from a screen or projector and I considered these some of my favorite lessons because they spoke more about human character. A perfect example is when the Codeup staff noticed a need in our community and decided to share their passion for service with all San Antonians. The office staff volunteered to serve at the San Antonio Food Bank. This was one of the unspoken teachings Codeup shared with me – these amazing individuals create an environment where you can grow in skill and as a human being. Kudos to them!\nI will iterate once again that Codeup will not force you to do something you don’t want to do. As a newly placed member of this ecosystem and a Codeup graduate I would like to ask Codeup fellows and members of the community to ponder, “How are we contributing to the San Antonio ecosystem?” Having the heart of a servant is something Codeup can’t force you to do, but is a skill necessary to achieve self growth and development.\nDon’t eat the tacos!\n\nvia GIPHY\nCodeup is geared to focus on your professional life, and not your waistline. The Codeup family loves to spoil the cohorts with food, they must know the way to a developer’s heart. The morning tacos, the pizza, and snacks should be enough to lure you into the Vogue building. I loved every bite and sip of these delicious perks. However I do have to confess I gained a few pounds during my time at Codeup. I was also on a budget so the ramen noodle isle at the Walgreens became very familiar. Now that I look back I wish I only had one slice of pizza instead of my usual three.\nOne of the hardest parts of my Codeup journey was finding time to exercise. Taking care of myself felt impossible in this intense immersive environment, but believe me when I say “It is possible!” This was thanks to one of my colleagues, who insisted on completing daily reps of stairs up and down the Travis Park garage.I felt instant restoration after just a few days of exercise. This simple exercise routine helped me deal with stress and gave me enough time to meditate on the things that pushed me towards triumph.\nDon’t bite the hand that feeds you.\nThe saying “Don’t bite the hand that feeds you” has stuck with me since I was thirteen years old, and made the dumb decision to complain about my job in front of my dad. My dad was not fond of me complaining of the man who signed my checks, so he shared a lesson behind his belligerent words. This made me realize that my ego was blocking my ability to humble myself, and that I needed to be thankful to the people that were trying to help me. His wise words taught me to stay loyal to those who become part of my upbringing.\nThis saying has stuck with me ever since, and I decided to mark it as a special lesson. A lesson I could only acquired through experience. I realize now the same goes with any organization or relationship that we hold, professional or non professional. We should be able to acknowledge where our loyalties stand, and if we are giving the proper amount of recognition to those who have helped us.\nThe Codeup staff did everything in their power to plug me into a bigger network of opportunities. Lastly, I was exposed to a network of genuinely loving, and caring people. These amazing benefits make me appreciate the Codeup program so much more. I walked in with the desire to learn computer programming. I am leaving with the ability and skills that say “I am a software developer!”\n"}, {"title": "The Message Behind Our Billboards - Codeup", "content": "\nYou may have seen Codeup’s billboards around town featuring recent career transitioners. We’ve featured former law students, baristas, hair stylists, military veterans, and more. We’ve recently heard that the advertising has offended people from those professions, so we want to explain our message more clearly.\nCodeup’s mission is to help individuals in transition change their futures by providing a fast and effective entry point into a tech career. We believe that everyone should have access to the new tech economy, and that you don’t need any specific background to do so.\nThat’s why we feature REAL graduates of our program who have started new careers from a diverse set of backgrounds. Luke used to be a soldier, Mars was a barista and bartender, John was studying law, and Sukari was a hairstylist. We’re not saying those weren’t real jobs! And we’re not saying software development is better for you. We ARE saying that each of our students chose software development for their own reasons. We highlight those stories to show that YOU, regardless of what career you have now, CAN become a software developer IF that’s what you want.\nDon’t just listen to us – listen to the real students whose stories are up on those billboards!\n"}, {"title": "Skills Fund: Financing to Fuel Your Codeup Future - Codeup", "content": "\nPicture this: You’re making a change. You’ve made a life-changing decision to attend Codeup in order to switch up your career or jumpstart your skills. You’re on your way to a transformed life – with just one barrier in the way: paying for your Codeup tuition and cost of living.\nCodeup is focused on two things: you and your success. Their curriculum is designed by experts and regional employers, the coursework is taught by the best instructors around, and they have a track record of successful graduates.\nSkills Fund is focused on two things: you and your success.  Take what you’ve heard about or experienced with student loans, and throw it out the window. Whether you’ve proudly served our country and you’re ready to enter the workforce, you’re just starting your career, looking for a career switch, or upskilling, we’re providing a return on education by only partnering with bootcamps and schools that provide impactful, proveable outcomes to their students.\n“Tuition is the number one concern that applicants have coming into Codeup, and having a trusted lending partner like Skills Fund to direct them to is extremely beneficial.  As an Admissions Manager, I am confident that Skills Fund is providing a great experience to our students and offering a great product to help them cover their tuition costs.”\n-Mario, Codeup Admissions Manager\n\nWhat does this mean? We’ve partnered with Codeup to provide clear-cut, fully upfront, and transparent financing for tuition and living expenses. Eligible students may borrow up to $21,500 for tuition and $6,000 for cost of living.\nBut – a student loan? We get it. Traditionally, loans have been confusing – and unnecessarily so. We’re on a mission to be transparent, up-front, and honest about all the terms involved with our financing. We’re the only lender that provides all details of your financing before you even apply. Students may discover their rate (interest rate + general APR) and monthly repayment amount using our loan calculator on our partnership website.\nHow will I repay? While you’re attending Codeup and for two months of grace afterwards, you’ll make low, interest-only payments towards your loan balance. After your grace period ends, you’ll begin full repayments. We’re betting on your future, so there should be no strings attached: you can pay your loan off at any time with no prepayment penalties.\nHow does it work? The simple process takes just four steps.\n\nAfter you’ve applied to Codeup, head to the Skills Fund partnership website to discover your terms, calculate your monthly repayment, and apply for a loan online in less than 10 minutes. Choose from a 3- or 5-year loan, and add on cost of living financing if needed.\nAt the end of the application, we’ll let you know whether or not you’ve been approved. If you’re denied, you may be given the opportunity to add a cosigner.\nOn the second Wednesday after your program begins, your tuition financing is sent to the school and your cost of living is sent directly to you.\nYou’ll start making payments one month after your loan is disbursed. You’ll be provided with several options for making payments, including AutoPay.\n\nWhat if I have most of my tuition covered, and only need to borrow a small amount to attend? With Skills Fund, you can borrow as little as $2,000 towards your tuition. You can calculate your monthly repayment online to understand what you would need to contribute to your financing per month.\nWhat if I have a low credit score? Skills Fund believes in you and your future, and that is reflected in our underwriting. If you’re credit denied, you may be eligible to apply again with a cosigner.\nTo learn more about Skills Fund financing for Codeup, visit our partnership website or email us at CustomerTrust@Skills.Fund.\nLEARN MORE\n"}, {"title": "Women in Tech Scholarship Recipient: Amy - Codeup", "content": "\nOne thing that I can proudly say after this whole Codeup process is that I survived (and thrived) as an independent woman, although not without serious help from others!  This is my opportunity to thank those who have helped, including Codeup for generously offering me their Women in Tech Scholarship.\n\nBefore Codeup, I was working full-time in another industry with a low salary.  I lived alone and was paying for all my rent and bills on my own, with no partner or parents for financial support.  In my field at the time, I struggled for years seeking advancement and growth opportunities from an industry that did not seem to value my skill set.\nEven given that stressful mindset, the idea of forfeiting my only source of income for several months to attend Codeup was extremely scary.  To justify this, I spent a lot of time researching, including attending Codeup sponsored events, and reaching out to Codeup alumni and friends in the tech industry for their opinion.  Still, with all the encouragement in the world, my objections were:\n\nWill employers hire me over a degreed Computer Science graduate?\nWill I be a “good” coder?\nWill I be an attractive candidate to employers, with my non-tech background?\nHow long will it take me to get hired?\nWill this investment in Codeup be worth it?\nWill I run out of my savings and die penniless on the mean streets of San Antonio (severe and irrational anxiety speaking here!)\n\n \nLet me just go ahead and assure you that everything worked out – very well, in fact!  I made the leap of faith and decided to join the Redwood cohort. Here is my first person to thank: a male friend of mine who has been a programmer for years, who strongly encouraged me that this was a great direction for me to take to secure fulfillment and my continued independence.  I struggled to find statistics on this, but I have heard many similar stories from women about the men in their lives (friends, family, boyfriends, husbands) who work in the tech industry and encouraged them to learn to code.\nOn the first day of class, I counted: 6 women out of 23 total students.  Not bad! Despite the fact that these women were of different ages, marital statuses, careers, and stages of life, we all quickly bonded.  Within the first few weeks, we even planned our own Girls Night Out at a bar across the street from campus (that the guys from our cohort crashed, and I don’t think anyone was upset about that)!  We also all participated in Codeup’s weekly women’s lunches, with featured female speakers who were alumnae or from the tech industry. Throughout the entire 18 strenuous weeks, these women and I supported and checked in with each other. Luckily, everyone in our cohort did the same, no matter the gender.  Thank you for this, Redwood women and men!\n \nTo make a long story short, I was hired as a full stack developer a month before my graduation, with a decent pay bump from my previous career, and am now working in my second job in the field (yet another pay bump!) where I feel personally valued on a daily basis.  All of this, less than a year since starting Codeup!  As my final thank you, I am extremely grateful to Codeup for awarding me their Women in Tech scholarship, because it significantly reduced the loan amount I needed to attend, helped relieve a little bit of the anxiety of paying for Codeup, gave me more incentive to attend, and confirmed that I indeed was exactly what Codeup and employers were looking for in students and coders.\nIf you’re a woman who desires independence and self-fulfillment, Codeup is worth it!  Make sure to apply to the scholarship during your admissions process and feel free to reach out to me or other female alumnae if you want to hear more about our experiences before, during, and after Codeup.\n \n—\nAmy is very proud to say she is currently the only female developer employee working on Whataburger’s first ever online ordering platform. She has a Master’s degree in Music Theory and keeps that knowledge fresh by analyzing music on the radio during her daily commute. Since learning to code, what she enjoys the most is mentoring new developers.\n"}, {"title": "Anxious About the Job Fair - Codeup", "content": "\n\n\n\n\n\nI hope you’ve got your resumes ready, because Codeup’s bi-annual Tech Job Fair is coming back this Fall! For most people, this is an exciting event, full of opportunity and new beginnings. While for some, the words “Job Fair” provoke anxiety and a deep-seated fear of proper handshaking.\n\n(via GIPHY)\nTo help a few of you entry-level folks out there, I sat down with my boss Fred Tawil – President of Swipetrack Solutions – and asked him if he had some advice for anyone attending the Job Fair in September.\nInterview With the Boss\nHow did you get into tech?\nI taught myself how to program years and years ago. When I graduated as a political science major, I needed something to do. My dad owned bingo halls and he needed a player tracking system, so I figured okay, I’ll make a player tracking system. I taught myself how to program, I built the kiosk and built the software to run the player tracking.\nAs someone who didn’t formally study something like CS, what has been the most difficult thing about managing a bunch of programmers? \nI don’t know. Everybody has their own method of programming and development. It’s that balancing act between getting something done quick and getting it done right. It’s figuring out how much time we can spend making it reliable versus getting it deployed.\nThat’s true. There’s always something new coming out in this industry.\nYeah, it’s always good to keep an eye out on what’s coming up, that way you’re not stuck when something gets depreciated or reaches its end-of-life.\nWhen you’re hiring, do you typically read everyone’s resumes?\nIt depends. We typically glance at them. I understand that a lot of Codeup grads weren’t in tech and are trying to move into it. That’s actually good for us, especially as a small company. We like to see previous work history so we can hire someone with multiple skills.\nBack when you were conducting the interviews yourself, what are some things that would make a candidate stand out to you?\nMost of the time when we’re hiring, we get a lot of competent coders that come to see us, and we see lots and lots of resumes. But an important thing for us now is, will this person fit in with the environment and will they like working here? When it comes down to the interview, you can be a competent coder, but what we want to know is if you’ll mesh with the group of people here and if you’re someone we can work with day to day.\nHow important would you say it is for someone to have a personal website and to have recent commits on GitHub?\nI can tell you we looked at everyone’s personal website if their resume looked good. GitHub accounts not so much, because a lot of the time when someone is coming from a coding bootcamp they’re all the same. A lot of the websites also looked similar, but if there was a way that you set yours apart, we saw those and those were pretty interesting.\nFor us it’s not so much what you did while you were at Codeup, it’s what else you did. Show me that you really enjoy programming and that you do it in your free time, as opposed to just looking for a higher paycheck. Do you have any apps in the App store, or a web application you made? Did you actually spend time on your website? I can tell you we do look at the source code and make sure if we’re hiring somebody that they didn’t just use a theme they bought on the internet and are pretending they built it. It’s very easy to tell.\nDo you have any advice for anyone who is nervous about going to their first Tech Job Fair? \nIt might be different, but I think it’s more laid-back. I would say to just relax. The three or four times we did it, we enjoyed talking to people and finding those whose personalities stood out. So be relaxed, enjoy it, and just talk.\nFrom Personal Experience  \nI clearly remember attending my first Tech Job Fair back in 2017, only because I was extremely anxious every day leading up to the event. I would go to Geekdom after class and had late nights to make sure that my website and online profiles were ready to go. Once the day came and I got there, my first thought was to run back to the car.\n(Image: Tenor)\nThree Easy Steps\nWhether you’re planning to attend the Tech Job Fair to find employment or to network, it’s completely normal to be a little worried about it. So here’s my advice:\n\nDo Your Research\n\nI can vouch for the importance of doing a little research before attending. Make sure to look at the list of companies who will be there and make a mental note of those that really interest you. You’ll be better off and more prepared to ask all the right questions.\n\nIntroduce Yourself\n\nIf you’re not quite sure how, “Hello, my name is…” goes a long way.\n\nFollow Up\n\nThis is the step that most people forget. If you find a place that you fall in love with, you need to follow up. Why wouldn’t you? That would be like falling head over heels for someone on the first date and forgetting to call. There are plenty of fish in the sea and a simple email thanking them for their time could be the reason they remember your name.\nPro Tip: If you’re currently in Codeup, you can even invite them to Demo Day and have another shot at impressing them with your new skills.\n\nvia GIPHY\nBottom Line\nMost importantly, STAY TRUE TO YOURSELF. Getting hired into a new company is a lot like entering a new relationship. Companies want to hire someone they can get along with everyday – someone who values their work and the company culture. Ultimately, you want to be hired by people who “get” you. It’s usually easy to tell when someone is not being genuine, so avoid pretending to be someone you’re not. Put yourself out there, smile and most of all, bring some hand-sanitizer because you’re going to be shaking a lot of hands.\n \n \n—\nSophie studied music for a few years before diving into the world of web development. Now it’s too late to go back because there are bugs that need fixing.\nHer husband is also a software developer, and their baby looks a lot like Pooh Bear.\nIn her free time she covers music, re-watches The Office and drinks more bubble tea than any person should.\nShe is serving in the Texas National Guard and currently trains at Aerial Horizon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"title": "Codeup Student Check In: Month 1 - Codeup", "content": "\nCodeup welcomed our newest cohort, the Wrangell cohort, on July 23. With the start of this cohort, we are launching a new blog series: the Codeup Student Check In. We’ll interview a student over the course of the 4.5 months to see how things are progressing from first impressions all the way to graduation. Thus, welcome to the Codeup Student Check In: Month 1!\nWe took the time to sit down with our Wrangell student to see how they’ve been doing so far!\nCodeup: How did you hear about Codeup? Why did you want to apply?\nWrangell Student: My first encounter with Codeup was during a drive downtown. I’m glancing at billboards while I’m driving and I see Codeup on one of the billboards. I remember thinking I wasn’t fully satisfied with my position in life, and my future goals aligned with Codeup’s mission. So I took a risk and applied.\nC: What was the application process like?\nS: The application process is very easy to understand. You apply directly on the website, and a member of the team reaches out to you. There are a few steps in the process itself, including an interview, a campus visit and a skills assessment.\nC: Tell us about any financing options/grants/scholarships you received. Did you owe anything out of pocket?\nS: I’m very happy to report my expenses are fully covered by a few grants and scholarships. The City of San Antonio Workforce Solutions grant, the Alamo College Techworks grant, and the Women’s Scholarship all helped to cover the cost so that I paid nothing out of pocket.\nC: Describe a typical day for you from start to finish\nS: We start off with announcements and then what we call “push-ups,” which are morning exercises to practice our chops. Sometimes we work on yesterday’s assignment, or we  jump straight into lecture. After lecture we practice the material with an exercise. Then we have a lunch break. After lunch we come back and listen to afternoon announcements. We have lecture time again, followed by another exercise.\nC: Describe what you’re learning right now. Is it hard/fun/challenging?\nS: Right now we are learning how to interact with the Google Maps API. This is probably the most challenging thing we’ve gone over so far. It’s very different extracting and working with code that is not your own. It feels like learning coding conventions all over again. But it’s still a lot of fun!\nC: How has the learning process/information gathering been?\nS: The learning process has been amazing. We use the Codeup curriculum website in combination with other resources, such as developer websites, and program documentation.\nC: What has been the most memorable part of this month?\nS: It is empowering seeing a project idea go from a blank slate to  a full functioning program. The most memorable part of this month was the first time I ran a program and saw all the colors and components jump out at me on the screen.\nC: How do you feel your skill level compares to when you started?\nS: My skill level has definitely increased compared to where I was initially. I think one of the most valuable things I’ve been taught are the tools that developers use on a daily basis such as Github, git, Node, the IntelliJ IDE and more.\nC: How have the instructors been helpful?\nS: The instructors are very receptive to feedback. They recognize that their students are extremely diverse with different skill levels, and respond in an understanding manner. They also encourage us to work hard for a problem answer, rather than just giving it to us outright.\nC:  Can you share a fun experience you have had this month?\nS: It is so much fun talking to my classmates and realizing how kind and open they are. I initially wanted to be alone on my lunch break, but then I had so much fun eating lunch with my classmates! I feel that Codeup is even helping me overcome my shy nature, and feeling the change within myself is fun and enlightening.\n"}, {"title": "Announcing Our New Minorities in Tech Scholarship - Codeup", "content": "\n\n\n\n\nBy Kyra Seegmiller\nWe have exciting news! Today launches our latest scholarship available for students – the Minorities in Tech Scholarship!\nThere are startling statistics about minorities in the tech industry. While we aren’t located in Silicon Valley, we want to continue fostering and cultivating inclusive growth in not just the tech industry, but San Antonio as well.\nThis scholarship joins our continuously growing list of scholarships, including ones for women, veterans, first responders, and the LGBTQIA+ community, and we are committed to our city and the emerging economy.\n\n"}, {"title": "Fresh Out of Codeup: Cayden Simler - Codeup", "content": "\nFresh Out of Codeup: Cayden Simler\n \n\nFresh Out of Codeup: Cayden Simler\nDigiboost recruits unprecedented talent from Codeup\nBy Mark A. Alvarez II\nThere is so much more than meets the eye when meeting Cayden Simler, Digiboost’s newest developer. The Codeup graduate has set a new standard at Digiboost, by not only meeting expectations but exceeding them with his passion for technological innovation. From humble beginnings as a military child, moving from place to place, to building a life in San Antonio, Texas, Cayden is a one of a kind talent, displaying a multitude of skills ranging from CSS, JavaScript, PHP and troubleshooting methods for solving developmental problems. At Digiboost, Cayden hopes to empower and enable small business to thrive in a corporate world with his distinct style and approach to coding. \n“I want to be a part of building up the Digiboost brand while also building up the small businesses that come to us for support,” Simler said. “I really want to contribute and give back in the best way I know how.”\nAfter acquiring a taste for web development in high school, Cayden looked to Codeup as an alternative to obtaining a four-year degree. Codeup provided Cayden with a program focused on developing the skills required for his role as a web developer. Codeup’s hands-on approach to coding proved to be helpful to Cayden, allowing him to immediately put to practice everything he was learning. In just 16 weeks, Cayden was certified in Full-Stack Development, dubbed the status of Junior Software Developer, and matched up with one of Codeup’s employer partners. The Codeup program is dedicated to providing its students with the skills necessary to effectively land an entry level coding position and launch their career in software development. \n“Codeup was designed exactly the way I needed it to be,” Simler said. “I gained the ability to problem solve, debug and learn new coding languages quickly. I  learned methods through whatever means necessary and created a fast entry into a career as a developer with the skills I needed to succeed.”\nSince starting at Digiboost, the team has been beyond impressed by the level of commitment and efficiency Cayden has brought to the company. His developmental knowledge has brought him to become one of Digiboost’s lead developers.\n“Cayden is a true asset to Digiboost,” Brian Campbell, Digiboost Client Care Specialist, said. “I hadn’t heard much about Codeup or the types of skills they taught, but Cayden is quite versed in several different coding forms. He has proven to be a great resource, either with live customers or with employees in the office. In the future, I can see Cayden moving into a senior type role very fast. But I believe his skill set is something we need and want him to get more advanced in.”\nCayden’s display of talent and proficiency have proved to be the type of personality sought out by Digiboost. His pursuit of excellence within his field has proven to be quite the journey, one that has earned the admiration of his team and colleagues. Surely, looking to the future, Cayden is bound to leave a lasting impact at Digiboost while growing and utilizing his incredible talents. \n“I’m very excited for the future of tech in San Antonio and Codeup’s role in the tech district. This is an opportunity for us to all grow towards a shared vision,” Jason Straughan, CEO of Codeup, said.\n—\nThis is the second of a new Codeup blog series which will feature guest articles related to software and technology.\nMark A. Alvarez II, Digital Content Writer at Digiboost.\nmalvarez@digiboost.com\n \n"}, {"title": "Top Trends and Tools for Recruiters in the Tech Industry - Codeup", "content": "\nTop Trends and Tools for Recruiters in the Tech Industry\n \nBy Taylor McKinney\nRecruiting new talent is never an easy task. But within the tech industry, it’s even more tricky—you want candidates with sharp skills and competitive experience, but also those who can make room to grow and adapt to new changes. The methods you use to recruit will directly influence who you attract, so you’ll need to get innovative with your strategies if you want the best. Here are the top innovative measures being used in recruiting for the tech industry today.\nAssessing Coding Skills\nA candidate with formal coding education is a must. A candidate with years of workplace experience is even better. But neither will necessarily guarantee you’re getting the best developer or programmer possible. That’s where coding assessments come in. This skill-based method makes the recruitment easier by relying on hard data, which reduces unnecessary decision making and possible bias. It’s the closest you’ll get to knowing exactly how capable a candidate is, and exactly how they’ll perform, logistically speaking, for your business.\nChatbot Interviews\nThe interview process can be timely and even expensive, especially if you’re hoping to attract global or out-of-town candidates. Whether you use it for the interview itself or just the pre-screening process, a virtual session makes more efficient use of the selection process, both in time, money, and convenience. Try Google Hangouts or Skype for a free method, or check out a software review site for the best video interview software available.\nMore Efficient Applicant Tracking\nThese systems are known for being cumbersome and, ironically, even inefficient because they’re so often hard to use or even used incorrectly. The good news is that these systems are simplifying their programs with the help of AI and rebranding themselves as “candidate relationship management software”. Employers can now count on these programs to correctly track all potentials without error, as well as recommend new qualified candidates.\nA New Way of Interviewing\nThe standard “Where do you see yourself in five years?” question-and-answer interviews aren’t necessarily a bad thing, but they probably won’t land you any innovative hires. That’s why they’ve begun to fall by the wayside, especially in the tech world.\nWhile the core questions are still important, tech companies are now rebranding their strategies to shake things up a bit and make room for assessing soft skills and personality—the areas in which traditional interviews fall short.\nFor example, the NFL susses out potential candidates by using Wonderlic, an online personality test that assesses emotional intelligence, determination, and overall demeanor.  Companies are also ditching conformity by trying out unconventional meeting places like a coffee shop or cafe. It’s all about getting to know a candidate better in a more dimensional way, and these new tools and methods are a way to get to know a truer sense of a person overall.\nAnd what about helping out with the time-consuming task of recruiting? Here are some of TrustRadius’s Top Rated recruiting software for 2018, which help streamline the recruitment process of searching for, attracting, interviewing, and onboarding new personnel.\nOracle HCM Cloud\nTrustRadius Score: 7.7 out of 10\nBest suited for large companies with many employees, a considerable budget, and complex needs. Users like the quick and efficient support, rich interface and frequent updates of this talent management suite\nSmartRecruiters\nTrustRadius Score: 7.8 out of 10\nUsers like that it’s intuitive and user friendly, even for those not so tech-savvy. One user says “it allows me to prescreen applicants without going through the interview process. I receive an email anytime there is a potential candidate to review.”\nJobDiva (8.6 out of 10)\nTrustRadius Score: 8.6 out of 10\nFans of JobDiva appreciate its simple integration with external tools, convenient support, customizable features, and mass emails, which allow users to contact multiple qualified candidates all at once. One user says that JobDiva “allows me to prescreen applicants without going through the interview process. I receive an email anytime there is a potential candidate to review.”\n—\nThis is the first of a new Codeup blog series which will feature guest articles related to software and technology.\nTaylor McKinney is an Marketing Specialist at TrustRadius, which has become the most trusted website for B2B software reviews. When she is not writing about the latest tools and small business trends she is enjoying Austin’s beautiful scenery with her family.\n"}, {"title": "All About the Alamo Colleges Partnership! - Codeup", "content": "\nAll About the Alamo Colleges Partnership!\nIn April, it was announced that we are partnering with Alamo Colleges District to bring our students grants! Have you seen the spotlights on the news? We’re really, really excited about what this means for our students.\nThanks to the Department of Labor, our students, if eligible, may receive up to $3,500 to apply towards tuition or living-related expenses. Here at Codeup, we currently use third-party lenders and accept GI Bill® education benefits, so this partnership means one thing: lowering barrier of entry for our students.\nOur CEO Jason Straughan sums it up: “If [the Alamo Colleges] mission is to create more workforce opportunities in software development, then we’re interested. Our goal is to help transitioning students, either from the military or the private sector, enter the software development workforce in an entry-level position, knowing that population grows into the next mid- and senior-level developer. It’s definitely a career where experience matters.”\nCurrently, 81% of our students have received this grant. Students use the grant in conjunction with other forms of financing:\n\n56% use VA Benefits (GI Bill®)\n28% use a Loan (Climb, Skillsfund, Personal Loans)\n11% use an additional grant (WIOA, Project Quest)\n17% received a Codeup Scholarship (Women in Tech, Relocation, Veterans, First Responder)\n\nAre you curious if you meet the qualifications? Check out our page on Alamo Colleges or try out our Financial Aid Estimator (Beta).\nSound exciting? If you want to see if coding is for you, we are offering a FREE Learn to Code workshop later this month! This is a great opportunity to dip your feet into the world of coding, see our space, and meet our staff and ask us any questions. This event previously sold out, so RSVP now to reserve your spot!\n\n"}, {"title": "The Job Fair is Over....Now What? Post Job Fair Tips - Codeup", "content": "\nThe Job Fair is Over….Now What? Post Job Fair Tips\n \nWe’ve written about how to kill it at the job fair and how to leave a lasting impression at the Job Fair. But, what happens when the Job Fair doors close?\nHere at Codeup, we’re passionate about bridging the gap between talent and demand, so we’ve outlined helpful tips to ensure you continue bringing your A-game and leave a lasting impression!\n1) Make meaningful connections with employers on LinkedIn\nDon’t let yourself become someone they barely remember. Find the recruiters on LinkedIn and connect with them.\nAdd a personal note as to why you want to connect with them. Consider recapping conversations you had at the job fair and reiterating what position(s) in which you were interested. Don’t blindly connect – remind them of who you are!\n2) Social Media\nUse social media to your advantage! Companies are more connected than ever before, so what better way to show you’re interested than by following them on social media? Some key ones include LinkedIn, Facebook, Twitter, and possibly even Instagram. But, WHY social media? You’ll be constantly in the loop of what the companies are up to and what they’re in the business of doing. As a result, you stay relevant.\n3) Set up alerts\nIn the advent of social media, apps are also on the rise. Set up alerts through your favorite job sites – almost all of which have apps.\nHere’s a few that our Director of Employer Partnerships recommend:\n\nLinkedIn and the LinkedIn Jobs app (iOS) and (Android)\nIndeed\nGlassdoor\nDice\n\n4) Double check your resume\nDo you have two resumés? It’s best to have two – one that is tailored for the role you want and one tailored to recruiters. Hand out the latter one to recruiters or at job fairs. It should also highlight the well roundedness of who you are!\n5) How’s your cover letter?\nStep one: do you have a cover letter? Step two: is it one that can be tailored with minimal effort? While most companies nowadays don’t require a mandatory cover letter, it’s good to have one on file. This link has great tips on prepping one.\n6) Recruiters can be your friend (in the professional sense)\nA good recruiter won’t view working with you as a transaction. Working with a recruiter allows you to a) outsource a significant portion of the job search while also gaining a direct connection to a professional network b) give you access to a transparent job search process (such as company culture and interviewer style). In addition, it’s in a recruiter’s best interest to stay in touch with you once you accept an offer to make sure you’re adjusting. You’re not a transaction – you’re an investment. When they see you continue to succeed, it allows them to stay at the top of your mind as you continue your professional path.\n7) Show that you’re available\nDoes your LinkedIn reflect that you’re wanting to hear from recruiters? This is an often overlooked step, but is key when actively job searching.\nOther (little) things that make a (BIG) Difference\n\nFunctional email address\n\nHave a functional GMAIL address. Why Gmail? It’s encrypted in transit and at rest. These emails are typically embraced by HR and recruiting managers\nIf you have an email ending in .edu, that’s okay!\nIn addition, a naming conversation is encouraged, like “first.last,” ‘last.first,” anything that incorporates your names and not personally identifying information (i.e. birthdays, SSN)\n\n\nSet up an outgoing voicemail, so recruiters aren’t totally detracted from the message. It helps convey a soft skill by hearing a voice\n\nWe know robo calls are the worst. But, it’s best to answer your phone from unknown numbers while job searching – especially if it’s a local number to the job market where you’re searching. It could be a recruiter or a hiring manager who’s interested in you in that very moment, and may pass you up for the next person that picks up the phone.\n\n\n\nThe next Tech Job Fair is scheduled for September 2018. Until then, we wish you all the best of luck as you continue navigating through the job search!\n"}, {"title": "10 Tips to Crush It at the SA Tech Job Fair - Codeup", "content": "\n10 Tips to Crush It at the SA Tech Job Fair\nSA Tech Job Fair\nThe third bi-annual San Antonio Tech Job Fair is just around the corner. Over 25 companies will be at The Jack Guenther Pavilion on April 10th, and they are hungry for new tech team members!\nAt the job fair, companies want to quickly source a list of new talent leads. AKA they need to find qualified employees they can begin interviewing for jobs. Recruiters will represent their organization at tables with informational handouts and company swag. Your goal at a job fair is to set yourself apart from other candidates and ensure your name makes it to the top of those lead lists.\nThink of your interaction with the company as a mini screening interview. The company rep will subtly evaluate basic qualities like your professionalism, communication and interpersonal skills, work experience, and interest level in the organization. Job fairs are also an opportunity for you to gain information about companies that may not be easily accessible online.  \nAt Codeup, we’re passionate about bridging the gap between talent and demand, so we’ve outlined 10 tips to ensure you bring your A-game and leave a lasting impression!\n10 Tips for Totally Crushing it at the SA Tech Job Fair\n\nUse keywords to describe your skills, but don’t go overboard. You’ll probably be talking to a recruiter or talent acquisition specialist. As a technical candidate, recognize these individuals usually aren’t developers or network administrators. They know terms like “JavaScript” and “Apache,” but haven’t written a line of code or spun up a server, so don’t get too caught up in industry jargon.\nResearch the companies ahead of time. Review the list of attending companies and make sure you know what the company does and whether or not they hire people in your desired role. Look up recent news on the company and mention it during your conversation.\nDefine your own goals for the job fair. Are you searching for a specific type of role or company culture? What matters most in your job search? Are there companies you want to prioritize?  Develop a game plan and be intentional with your time.\nPrepare a stellar résumé. Bring about 20 copies of your résumé to the event, printed on nice paper. We won’t cover resume writing in this post, but there are a plethora of online resources you can consult. For job fairs, don’t worry about cover letters.\nPolish your online profiles. If recruiters have a copy of your resume, you can be sure they will stalk you online soon. Make sure your online presence is professional and appropriate. A good place to start is by Googling yourself. Update your LinkedIn, and clean up any social media profiles.\nCraft a 30-60 second elevator pitch. You may only have a few minutes with an employer. What will you say if they ask, “Tell me about yourself?” Consider structuring your pitch like this: Who you are + What you do + What your goals are + Why that matters to the company.\nDon’t show up in a t-shirt, but trade in your suit for something more chill. Always keep it professional, but remember: tech is typically more casual than other industries. You’ll likely feel out of place if you look like you belong on Wall St., so refer to this guide on dressing for tech interviews.\nDon’t forget the basics. Start and end each conversation with a firm handshake. Make eye contact while conversing. Smile! Thank the recruiter before you move on to the next table.\nAsk educated questions. Don’t waste valuable face time with recruiters by asking questions like, “What does [Insert Company here] do?” They hate that question! Instead, try some of these:\n\nWhat are the top 3-5 examples of knowledge, skills, and abilities you look for in candidates?\nWhat’s the best advice you have for someone who wants to work here?\nWhat is your interview process like?\nAre you hiring for any roles not currently listed on your websites?\n\n\nFollow up. Collect business cards from each table. The next day, send a short note expressing your interest in the company’s opportunities and thanking the recruiter for his or her time.\n\nRSVP for the SA Tech Job Fair taking place at the Jack Guenther Pavilion – September 18th starting at 4 pm. \n"}, {"title": "5 Hiring Trends in Software Development - Codeup", "content": "\n5 Hiring Trends in Software Development\n \nCompanies (and ideal candidates) care about solving problems for the end user.\nHiring needs in the tech industry – specifically on software development teams – evolve almost as quickly as the technologies themselves. One year employers are trying to get their hands on Ruby developers, and 12 months later, a new JavaScript framework is all the buzz. This doesn’t make things easy for job seekers or new employers looking to hire their first software developers.\nDrawing on conversations with our 200+ employer partners at Codeup, we’ve compiled a shortlist of five trends we’ve seen emerge recently. In a nutshell, it’s all about solving problems for the end user.\nThe growing popularity of Agile has created more opportunities for full-stack developers.\nFirst, what is Agile? In a nutshell, it’s a set of management practices that allows software developers to write code and build products more efficiently.\nAgile has gained serious ground in IT departments across a variety of industries, from finance to food service. While Agile doesn’t explicitly require a team of full-stack developers, it does ask developers to be fully engaged in all facets of building an application, from creating user stories to deployment. As a result, roles on an Agile team start to blur, and each individual winds up working on features across the tech stack.=\nThere’s no doubt that a team of specialized front-end and back-end developers can build great software. However, today’s hiring managers seem to have a preference for full-stack developers, or at least those who understand both sides of a given tech stack, because these well-rounded employees have a leg up on others in an Agile environment.\nGood software development leverages design thinking across the stack to benefit the end user.\nStructure and efficiency are still important for software engineers to get right, but more and more, it’s critical for developers to code across the stack with the end user at top of mind. In fact, Agile teams dedicate time to create user stories that inform the products they build, and each team member is involved in a recurring (or iterative) design process.\nTim Brown, the CEO of international design firm IDEO, says, “Design thinking is a human-centered approach to innovation that draws from the designer’s toolkit to integrate the needs of people, the possibilities of technology, and the requirements for business success.”\nSoftware is everywhere these days, and it’s not just for techies. Solutions need to be slick, innovative, and easy-to-use. The latest version of iOS or Android needs to be impressive enough for tech enthusiasts to get excited about and straightforward enough for grandpa to check his voicemail. Most importantly, good developers realize those two things aren’t mutually exclusive.\nJavaScript takes candidates further than ever before.\nNow more than ever, a strong understanding of JavaScript can really help software developers land a great job.\nOnce a fairly basic, client-side scripting language, JavaScript has made powerful gains in functionality while staying lean and efficient. In recent years, Node.js, a server-side runtime, has transformed JavaScript into a full-stack powerhouse.\nJavaScript continues to deliver on the front-end, too: React.js has revolutionized user interface development and has become the front-end JavaScript framework of choice for Fortune 500 companies and startups alike.\nDiverse and non-traditional candidates are in the spotlight.\nDiversity in tech remains elusive and persists as a key talking point in the industry. Women, as well as black, Latinx, and LGBT workers, remain severely underrepresented. In light of this year’s high-profile headlines on gender diversity issues at Uber and Google, many tech companies have doubled down on their commitments to boost workplace equality and employ people who authentically empathize with a diverse group of end users.\nWe’ve also noticed a growing trend toward diversity initiatives that aim to include nontraditional hires like military veterans, career changers, and candidates without four-year degrees. For example, the Microsoft LEAP initiative seeks candidates who have tech experience but may have been out of work for a while (e.g., stay-at-home moms or dads) or career changers with at least six months of software development experience.\nStrong problem-solving skills remain the common denominator among great developers, and interviewers know it.\nThis is less of a hiring trend than it is a skill that employers continue to require of all new developers, especially non-traditional hires who may not have a computer science degree or years of experience.\nSoftware developers – especially those new to the field – are in a constant state of learning new technologies and solving problems they’ve never encountered before. The ability to define a problem, recognize key inputs, and identify potential solutions is particularly important when the quality of a line of code depends on the developer’s ability to think logically and efficiently.\nInterviewers often ask candidates to walk through a scenario, usually a past experience or a hypothetical case study, where the candidate needs to demonstrate their ability to assess a problem and formulate a solution. Sometimes these questions can be technical and quantitative, other times they’re more behavioral, but either way, it’s clear that companies want employees who think well on their feet and come to their managers with solutions instead of self-explanatory questions.\nConclusion: Honing your skills to meet employment trends can help you get a software development job, but first, invest in learning the fundamentals of programming.\nBeyond these trends, employers continue to look for one thing above all else: technical skills! Before learning a new JavaScript framework and doing research on best practices for design thinking, you’ve got to have the fundamentals of software development under your belt. That’s where Codeup comes in. Our 18-week career accelerator gives you all the tools and training you need to capitalize on these trends and land a great job as a software developer.\nTo learn more about Codeup, email us at info@codeup.com or apply today!\n \n"}, {"title": "What Makes a Successful Software Developer? - Codeup", "content": "\nWhat Makes a Successful Software Developer?\n \n4 questions to ask yourself when considering a career as a Software Developer.\nWritten by Dimitri Antoniou\nSoftware developers build the programs, games, and apps that run on your computer, cell-phone, tablet, video-game system or e-reader. A software developer can be front-end, back-end or full-stack.\nSuccessful software developers come from diverse backgrounds and a variety of industries. Here at Codeup, our job is to advance existing careers and launch new ones. That means we’ve seen it all. We’ve learned that being a successful software developer comes from the right combination of personality traits and technical knowledge. We’ve gathered a few questions to ask yourself if you are considering becoming a software developer.\n#1: Do I like working with computers?\nYou will spend your time building, improving and maintaining different types of software across different pieces of technology. This means that working with computers, phones & tablets should be something you enjoy. This might sound obvious, but it’s huge! We often meet students who are attracted to tech because of exciting new products, collaborative work environments, and flexible schedules. These are all awesome perks, but remember that the most important piece of your work will be the code itself. A software developer spends the majority of their time fixing problems and building frameworks.\n#2: Do I love to learn?\nTechnology is a constantly evolving industry. While one language is hot today, it might die tomorrow. Our co-founder, Jason Straughan, often reminisces about writing an entire book on a language that disappeared from use by the time the book was published. What does that mean for you? You should love the process of learning new skills and keeping up to date with cutting-edge technologies. A career in technology gives you the opportunity to reinvent yourself many times. You may love working with databases today and find that UI/UX is where your strengths are in a year. You will need to be able to adapt to changes in the industry and be willing to learn on the job or put in the hours on your own time. The more programming languages under your belt the more value you will be able to provide during every stage of your career.\n#3: Am I gritty?\nGrit is a character trait that can make or break long-term success. Psychologist Angela Duckworth explains it as, “Passion and perseverance for very long-term goals. Grit is having stamina…sticking with your future, day in and day out.” When it comes to software development, having grit means learning from your failures. We’ve seen students struggle not because they can’t figure out the content, but because they are afraid of failing. Move past that fear! You will inevitably make mistakes, but our successful students are those that learn from their failure along the way.\n#4: Am I a problem-solver?\nAt the end of the day, code is designed to solve a problem! Your ability to think logically, brainstorm creative solutions, proactively research answers, and fill gaps will make you an effective and efficient software developer. That’s why we test for problem-solving ability in our admissions process. Do you like tinkering, Googling, fixing, solving puzzles, and finding your own answers? If you do, you may appreciate the challenges that come along with developing software and debugging code.\nThese are the questions to ask yourself when making the decision to become a software developer. If you answered yes to these questions, coding could be for you. At Codeup we offer an 18-week career accelerator that will help you get a foot in the industry. Ready to start? Call Codeup at 210.802.7289 or shoot us an email at info@codeup.com\n"}, {"title": "Alumni Spotlight: Stefanie Young and Lorne Barfield - Codeup", "content": "\nAlumni Spotlight: Stefanie Young and Lorne Barfield\n \nStefanie Young and Lorne Barfield are both Codeup grads and the co-founders of Innov8 Place, a website development company. Here, they share their highs, their lows, their experience and their best tips for succeeding during and after the program.\nPlease give a little introduction about yourself.\nStefanie: I’m originally from California. I grew up in the Silicon Valley before the days of Google and had a pretty decent handle on free internet via AOL Trial discs, Napster torrenting, and multi-player gaming platforms (before they were cool). Given the mid to late 90’s, I had quite a bit of backlash within the online communities for my gender and my age. I gave up on tech during my early college years when a female professor told me, “there no room for women in the booming tech industry.” I quickly turned to music and language arts and found myself pursuing the long-term degree before leaving for Texas to enter a Japanese Studies program. I had a rude awakening and poor experience when most jobs I was offered were non-technical, non-creative, and extremely repetitive. It wasn’t going to work. My grandfather had always been a firm believer that I was meant for tech, engineering and developing new ideas. After chatting with him about my failed attempts and unhappiness, I decided to give tech another try through coding and entered into the Codeup family. I worked full-time while attending a night class and found myself doubting my abilities from the beginning. During our first project, something clicked and with the help of the instructors, I had a new-found love for problem solving, developing and code. I haven’t turned back since.\nLorne: I’m also from California.  I hail from Oakland.  I’m into just about everything.  I have worked as a high school basketball coach, personal chef, bartender, bouncer, opera singer, paralegal/legal assistant, and dance instructor.  I love movies and books….I read about 40+ a year.  I’m into fantasy and sci-fi, but also enjoy reading Deepak Chopra and books about travelogues (which is somewhat funny because I’m terrified of traveling). I’m a hippie, jock, musician, and nerd. I love people and connection and for someone who grew up largely an only child, I’m always out creating new family.  If something interests me, I pursue it.  I like to dive into things that I can share with others.  I’m an avid NBA fan (Go Warriors!) and if you ever want to argue about basketball, I’m game.  If you want to see me fully free and in my element, put me around music and dancing. Programming puts me back in my Lego days, where I get to be creative and build things. It’s my new adventure. \n\nCan you describe your career path and how you got to where you are now? Were you always interested in programming?\nStefanie: I wasn’t always interested in programming. I had always seen programming as a career that leads to a dark room with smelly individuals, Cheetos and Mountain Dew. I didn’t want to be placed in a cubical and made to work 10 – 16 hour days to complete a project or operating system. Web development when I first set out to learn tech was not a major degree option or talked about much. Browsers were faulty and new to the scene. It was a questionable career path at the time. My grandfather was an engineer with Stanford University and always brought home hardware for PCs. I thought that would be my path as well. I loved building and problem solving the communication errors between parts. Little did I know that programming was that too on a more abstract and dynamic level.\nLorne: I absolutely thought programming was way out of my range and my experience.  Nothing about it felt like something I would be into.  I had simply grown out of my old position and location.  I was a paralegal in San Francisco and I was no longer challenged.  I wanted to go back to school or do something new but had no clue what.  It was too expensive to do there, my parents brought up Codeup (they live here), and here I am. \n\nWhy did you look into an immersive program? Why the Codeup experience?\nStefanie: Honestly, I was extremely doubtful of the program, especially after being trained into the thought process that traditional college was the only form of useful education and the only experience one should seek before career searching. It wasn’t until I was trying to break into marketing firms, coding communities and design groups that I was told about the program. Three people approached me and recommended the program. I didn’t listen. Then life started shouting it at me. I saw the billboard… then a marketing card in the mail… and then I heard a friend talking about their acceptance into the program. Finally I gave in and went to the Codeup location.I took a couple of tests and passed with flying colors. I decided to take the leap since they were offering a night program that started after work hours. Since they helped with job placement as well, I took them to be my chance at a better work life.\nLorne: I was on the verge of going to teach English in Turkey when my parents suggested that I look at Codeup.  I took the test, not sure if I’d get in, and then when I did, I bought a ticket the next day and the rest is history. \nWhat was your experience with Codeup?\nStefanie: Overall, my experience was eye-opening. I did not expect to have young mothers, grandmothers, high school graduates or college graduates with Masters in the same class. The culture was liberating since we were all there for the same reason – to change our paths and achieve new goals. The instructors were very hands on and helped everyone thinking about problem-solving in new ways and how to attempt developing ideas out of nothing. The hardest step was always deciding where to start and finding the confidence to dive in, code first, and prepare to work through your own problems and use the resources available. \nLorne: Codeup opened my eyes to a new world.  They made programming and something that seemed so daunting, really fun.  I never thought I would enjoy it, but the collaborative nature of it and the creative juices that got to come out, made me fall in love with it.  The instructors, the classroom, everything about it made me feel like I could do it.  I think that was the largest thing.  Despite any difficulties or frustrating, I felt empowered…like given time and community, I could solve anything.  That’s an awesome feeling. \nHow do you feel Codeup has helped/is helping you grow? Did/How has Codeup’s career services helped you?\nStefanie: The program taught me independence and confidence. I am more free-thinking than I have ever been. I understand how to think about everyday issues from multiple viewpoints, and I know how to stand my ground and prove my points and way of thinking. I know that it’s okay to be wrong and how to go about admitting it. Even if it seems counterproductive to building independence, I know it’s okay to ask for help.The program also taught me about resourcefulness and communication on a whole new level. These two features alone were enough to land me just about any job. Soft skills are just as important as the hard skills. \nLorne: It taught me how to break down problems.  It taught me how to ask for help and that is perfectly right and ok. Codeup gave me my first job, and kind of my second, as I worked for one of the founders as my second.  They always believe in their students and help them match and grow. \n\nAny advice for current and future Codeup Alumni?\nStefanie: Understand that this program is meant to accelerate your learning of development. You have to be hungry for this knowledge and supplement the curriculum outside of the classroom as well as practicing it. There has to be a drive for the goal ahead. Be willing to sacrifice some of your free time.This class is so much more rewarding if you learn to work as a class unit early on and help each other succeed. Employers will see it in your example work, the projects and want to hear about your ability to communicate and mesh well as a developer. Be open-minded and be willing to be wrong. I learned so much more from being wrong than from being right. Experience is priceless in the long run. \nLorne: Stay patient and humble.  This world of programming is huge.  It can be overwhelming.  Just keep that learner mind and understand that time and keyboard time are your greatest assets.   It may not feel like you’re growing, but then you’ll look up every now and then and realize just how much you know and how far you’ve come.  It’s a pretty awesome feeling. \nWhat was the best part of the experience in your opinion?\nStefanie: The staff and fellow classmates made the program great in my eyes. The interactions and experiences of having a new community of people who had similar goals made for a welcoming and productive environment.\nLorne: I think the greatest part is the classroom.  The idea that when everyone shares knowledge, everyone succeeds.  The collaborative power of coding is insane and if there’s anything I can attribute to the rapid rise of technology is that it brought a collective human mind to any problem.  People from all over the world now have the ability to work together to create brand new things.  You get your first taste of that in the classroom.  The sense that everyone wants you to succeed and you can lean on one another to fill in gaps where you may not be the strongest.  It’s a really amazing feeling.\n"}, {"title": "Alumni Spotlight: Mary-Kaitlin (MK) Warren - Codeup", "content": "\nAlumni Spotlight: Mary-Kaitlin (MK) Warren\nFrom being an Assistant Manager at Entreprise Rent-A-Car to becoming a stellar programmer, MK shares her path that led her to where she is now—a student in the Microsoft LEAP program.\nCan you describe your career story and how you got to where you are right now?\n Random. My senior year of high school, I started watching Bones and first heard of Anthropology. So I majored in Anthropology. I also majored in German, because I wanted a back up plan in case I decided not to go to grad school for Anthropology, and everybody knows that companies are fighting over German majors. The spring semester of my senior year, I had no plan and my family told me that I needed to get a job, so I hit up Monster and applied to Enterprise’s Management Training program. Randomly, I got the job. After 2 years I decided I didn’t want to do that for the rest of my life. I got on Monster (I should send them a card) and randomly found Codeup. I think it was an ad? Pretty sure I didn’t know what a bootcamp was at the time. After that, it gets less random and more Codeup driven. My first job after Codeup was with a company that had come to my Demo Day. The job after that was with a company that came to do onsite interviews at Codeup. I found out about my current opportunity through Codeup as well. So… three cheers (or jobs) for Codeup!\nHow do you think your past has brought you here to Codeup?\n I had taken a computer science class in high school and done well. When I was looking to transition out of the customer service/sales realm, I knew that I wanted a set of hard skills, and luckily Codeup offered a place to grow those.\nThere are a lot of options out there for learning to code. Why Codeup? \n I thought about trying to do something online, like CodeAcademy, but I ended up going with Codeup because of the connections. Where as DIYing your coding education is possible, it’s hard to get your resume through the door if you have no professional experience. Codeup helped make initial connections that have propelled me into the career that I want. Also, I am terrible at making myself watch videos online.\nWhat got you hooked on programming or the idea of moving into the tech space?\n I am drawn to programming because there is an answer. If your code doesn’t compile, there is a reason (and probably a silly one at that). It was a nice change of pace coming from a liberal arts background, where things are a little less black and white.\nWhat are some things you like about Codeup? \n Definitely the snacks.\nWhat would you change/want to see us do differently?\n It’s hard for a coding school to do this, because it is a business, but a little more clarity upfront about the types of positions to expect (especially in a market like San Antonio), would have been nice. Part of the reason why I decided to do Codeup was the claim that graduates made 15k more afterwards, and so I took out the loan for 15k with the idea that I could pay it back in less than a year. A month in, I realized that the average graduate salary was about 15k less than I was making, so that was a little disappointing and cause some numbers shuffling. Again, I know that’s kind of a hard thing to change, but it’s the only suggestion that I have. Everything else was pretty good.\nWhat are your plans after Codeup, both in the immediate and long term?\nWell, speaking in hindsight, short term was to get paid to program and get some experience on my resume. Long term is to move into a tech arch role, change the world with some awesome software and/or hardware, and become Tony Stark.\nA lot of people don’t think of SA as being a vibrant city for Society of Women Engineers (SWE). What have you seen in terms of the city, people, events, etc. that contradict this idea? \nWe’re on the comeup.\n I would say that San Antonio has a lot of companies that have very robust SWE communities that exist outside of the Downtown/Houston street epicenter. I think that because of the geography of San Antonio (read: sprawl), it is harder to see than a place like Austin or Seattle.\nWhat are some of the things minorities, disenfranchised and marginalized groups need to know about the support, or lack thereof, within Codeup?\n Codeup is there to support you. Practically speaking, their success is your success. Aside from that, everyone there is super supportive and just generally nice. If you aren’t understanding a topic, the instructors are willing to help and walk you through it (even on their lunch break. WOW!!!).\nWhat would you say to these groups of people who are on the fence about joining a bootcamp due to lack of diversity, inclusivity, and overall fear of not having the support that they would need?\n This is a bit tricky. I would say that first and foremost, know you’re own truth. Software isn’t for everyone, so have that moment of honesty where you decide if you are doing this because you like the idea of programming every day, or because you like the idea of a 6 figure salary in 4 months and working from home everyday (spoiler alert: highly unlikely for your first, or dare I say, second programming job). If you are passionate about building software for the rest of your life, I honestly believe that Codeup is the best place to start that journey. The community is incredible; the instructors are amazeballs; the staff is incredibly supportive; and the founders are boss *** hustlers. It truly is the best place to start your development journey in San Antonio. (P.S. if you are from out of town, forget Codeup. Come to San Antonio for the breakfast tacos, and stay for Codeup.)\nHow’d you find out about the LEAP program and what are some of the reasons for wanting to participate?\n Dylan sent out an email with some information about the program, and it seemed like an awesome opportunity. If you don’t major in CS, there aren’t a lot of opportunities to “intern” for the Microsofts/Googles/Facebooks of the world. LEAP is awesome, because it gives you that same foot in the door that an internship gives, even if you didn’t go the traditional Computer Science route. (Also: Seattle weather, multitude of hiking trails, coffee).\nLEAP is an incredible opportunity! What are you planning on doing after completing the program?\n Keep learning. Become Tony Stark.\nAnything else you would like to talk about regarding the Career Services and Development through Codeup?\n c:\\myPath. In other words, Codeup’s Career Services and Development has gotten me 3/3 gigs. That goes to show that just because you get your first job, doesn’t mean that you are out of the family.\n"}, {"title": "Competitor Bootcamps Are Closing. Is the Model in Danger? - Codeup", "content": "\nCompetitor Bootcamps Are Closing. Is the Model in Danger?\n \n\nIs the programming bootcamp model in danger?\nIn recent news, DevBootcamp and The Iron Yard announced that they are closing their doors. This is big news. DevBootcamp was the first programming bootcamp model and The Iron Yard is a national player with 15 campuses across the U.S. In both cases, the companies cited an unsustainable business model. Does that mean the boot-camp model is dead?\n\ntl;dr “Nope!”\nBootcamps exist because traditional education models have failed to provide students job-ready skills for the 21st century. Students demand better employment options from their education. Employers demand skilled and job ready candidates. Big Education’s failure to meet those needs through traditional methods created the fertile ground for the new business model of the programming bootcamp.\nEducation giant Kaplan and Apollo Education Group (owner of University of Phoenix) bought their way into this new educational model when they purchased The Iron Yard and DevBootcamp. They purchased their competition with the intent to scale up the model. Unfortunately, Big Education is too habituated to coming up short for students. They bought the upstarts that challenged them, tried making changes to run those bootcamps in the “Big Education” way, and, sadly, they’ve closed the doors when they realized that scaling education is more challenging when student outcomes truly matter.\nThe bootcamp model is still new and there will be plenty consolidation, competition, and changes in the future. This model is based on actually being adaptive, innovative, and sustainable. And there’s always room for innovation.\n\n\nWhat we’ve learned at Codeup…\n\n\nEducation is challenging to scale.\nPrioritizing quality over growth pays off.\n\nWhat we’re doing at Codeup…\n\nHigher standards in our application process are leading to better student outcomes.\nOur reputation and commitment to quality is opening new doors to previously uninterested/unreachable employers.\nIn the beginning, the majority of Codeup graduates went to work with startups and small businesses. We’re now seeing a larger amount of our graduates place at medium to large sized businesses.\nDemand is growing and employers are learning that the results are in the graduates.\nCodeup’s model is sustainable, inclusive, and works.\n\nCall or contact us today to see how Codeup’s commitment to quality and approach to being a career accelerator can make a profound difference in your life.\n"}, {"title": "Codeup Doubles Down on Transparency in Student Outcomes - Codeup", "content": "\nCodeup Doubles Down on Transparency in Student Outcomes\nStudent Outcomes and the Council on Integrity in Results Reporting\nWith pride and excitement, we’d like to announce that Codeup is an official founding member of the Council on Integrity in Results Reporting (CIRR). Codeup and all CIRR member institutions have agreed to a detailed set of student outcomes standards that eliminates unreliable graduation rates, ambiguous definitions of employment, and misleading exclusions from job placement rates.\nWe’re doubling down on our commitment to long-term student success, and we’re confident that CIRR will add an extra layer of value and integrity that our alumni, current students, and prospective applicants already expect from their Codeup education.\nCodeup is Committed to Transparency\nAt all stages of the Codeup program – admissions, in-class immersion, and the job search – our staff and instructors aim to provide students with realistic advice, so they can make the most of their software development education. Historically, we’ve done this in three ways:\n\nA selective admissions process that screens program applicants for motivation, professionalism, and problem-solving ability.\nTransparency with students struggling in class, or for whom software development may not be the best career path.\nA job-placement guarantee that offers graduates who maintain job-seeker status a 50 percent refund if they don’t find a job within six months of graduation.\n\nEven with ongoing efforts to improve these processes that monitor student success, however, we’re the first to admit that we’re human. As a small, evolving program, we recognize that we can always provide students with better feedback through detailed performance evaluations, structured student one-on-ones with instructors and staff, and transparency in student outcomes data.\nOur team has already addressed evaluations and one-on-ones, but forming a consensus on bootcamp outcomes data has been an industry-wide puzzle until now.\nWe began resolving this issue by asking ourselves a follow-up question:\nWith transparency and accuracy, how do we report on students who leave Codeup or do not obtain employment?\nFortunately, other principled, results-driven coding bootcamps have asked themselves the same question, and over the past year, we’ve come together under the CIRR umbrella. For the sake of our students, our alumni, and the future of our unique approach to coding education, we’ve agreed to a detailed set of standards that establish new definitions, documentation, and validation requirements related to student graduation and job placement data.\nOur Students Come First\nCritical feedback from students and alumni on bootcamp outcomes has informed so much of the CIRR process. Thanks to this input, the CIRR standards support the concerns of these very students by enforcing strict standards for student outcomes reporting and, in turn, providing Codeup with even more incentive to ensure student success.\nWe appreciate our community for holding Codeup accountable to the high standard you deserve. We hope you will continue to do so, as we advance our mission to help people launch rewarding careers in software development.\nAs always, please feel free to reach out to any members of the Codeup staff or info@codeup.com with any questions or comments.\n"}, {"title": "The Codeup Commitment to Your Financial Well-Being - Codeup", "content": "\nThe Codeup Commitment to Your Financial Well-Being\nWe’ve all seen the infomercials. Schools like ITT Tech and Career Point College have been peddling expensive, low-ROI degree programs for years. Students take out a loan to cover costs, only to discover that the school’s career services department doesn’t measure up. They graduate with few job prospects and lots of debt.\nRecently, regulators have shut down those schools because they’ve failed to put students’ interests above their own.\nCodeup is different.\nWe care about your finances, and we believe you’ll be a more engaged Codeup student and a better developer when you minimize your financial burdens. Our staff wants to help you do just that, so here’s our commitment to you:\nWe only encourage students to enroll at Codeup when they’re financially ready to do so.\nAlso, if you don’t find a job within six months of completing the program, we’ll refund half your tuition.\nIt’s that simple, and because we love transparency, here’s how we ensure our team always puts your financial well-being at top of mind:\nA fair and selective admissions process. Codeup pre-screens applicants for qualities we see in successful software developers, like problem-solving ability and motivation. Unlike other schools, we’re okay turning away students who might be better off in another career. People from all walks of life can become great coders, but we want to be sure your investment of time and money will result in a better career.\nEasy-to-understand funding options from reputable partners. As of this writing, Codeup is the only accelerated coding school in the South to accept G.I. Bill® benefits. Here’s a full list of ways to fund your Codeup experience:\n\nG.I. Bill® (up to full tuition coverage for most veterans)\nWomen’s Scholarships\nProject QUEST\nWorkforce Innovation and Opportunity Act\nEducation and cost-of-living loans through Skills Fund\nCrowdfunding\nBitcoin\n\nAn employer network based on relationships, not kickbacks. Employers fulfill their talent needs with us because they know the quality they get with a Codeup developer. Our career development team has one goal: Get our students into great jobs. We don’t charge employers for our services, and we don’t receive any commission for successful hires.\nLife’s too short for a misguided career decision.\nWe’re committed to helping people become stellar coders, but we have a conscience, and we don’t accept students for the sake of filling seats in our classrooms. Come learn to code from people who care.\nNothing makes us happier than fielding questions from prospective students. Are you unsure if Codeup is right for you? Do you want to become a software developer, but you’re not sure how you’ll pay rent in the meantime? Give us a call (210.802.7289), shoot us an email (info@codeup.com), or fill out our quick application, and we’ll be in touch shortly.\n"}, {"title": "ITT Tech Closes, New Model of Education Rises - Codeup", "content": "\nITT Tech Closes, New Model of Education Rises\nA New Model of Education\nITT Tech’s recent closure highlights the time barriers, financial risk, and poor career prospects that are finally catching up with the traditional for-profit education industry. So what can students do instead?\nForbes Magazine ranked San Antonio as the American city with the 15th highest rate of job growth in 2015 – no surprise given our city’s recent swell in tech and entrepreneurship. The boom has created a mismatch between a surplus of available jobs for developers and a shortage of local technical talent. Codeup, a career accelerator for new software developers, has begun bridging that gap by training 267 developers and creating $5.8 million in new tech salaries since 2013. \nCodeup is different from traditional models of continued education. Four-year universities and two-year technical schools often no longer serve students’ needs. The recent closure of ITT Tech, one of the nation’s largest for-profit educational institutions, is a great example. Tuition at schools like ITT Tech, DeVry, and Kaplan is high ($45,000 – $90,000), they have been found to use predatory lending practices, and they rank highest among colleges that leave students in the most debt. Graduates of ITT Tech San Antonio who received federal financial aid earned an average salary of only $38,400 ten years after completion, just barely above the national average for the category. Their overwhelming time commitment, high tuition fees, and limited career support make it hard for students to complete degrees and advance their careers. \nITT Tech Closes, Another Door Opens…\nGiven the decline of these diploma mills and a changing jobscape, other forms of education have exploded. The new reality is that the traditional college student archetype is now a minority, while demands for alternative, dynamic educational models are only increasing. Students need a better way to enter the workforce with relevant technical skills.  \nAs a four-month intensive career accelerator, Codeup offers something special: a place where students can find like-minded peers and launch a new career. Our classroom-based program turns non-techies into software developers. In addition to excellent technical instruction, students receive one-on-one career guidance and gain opportunities to connect with employers. If a graduate cannot find employment within 6 months, Codeup offers a tuition back guarantee. We partner with multiple reputable loan and grant partners to make financing easy, and also accepts GI benefits. Graduates have increased their salary by $17K in the first year on average. \nIn light of the recent closings of ITT Tech across the country, students should pause to reconsider their educational path choices. Codeup is San Antonio local, dedicated to providing students with community, professional independence, and technical literacy. Are traditional models the best option, or might Codeup offer something better?\n"}, {"title": "Codeup's Impact on the San Antonio Tech Community - Codeup", "content": "\nCodeup’s Impact on the San Antonio Tech Community\nHow Codeup Supports the San Antonio Tech Community\nAfter joining Codeup in early 2016, I quickly realized what sets us apart from other coding bootcamps: community.\nCodeup leads community development by sponsoring free learn-to-code workshops, monthly coding challenges, regular developer meetups, and closely partnering with many local companies around tech centered events.  We also hosted the Big Data Code-a-thon, a civic-minded hackathon, which allowed local software developers to use water data to create amazing new software for the Edwards Aquifer Authority.  Codeup consistently drives growth in the number of skilled developers available in the SA tech community by educating hundreds of budding software developers.  As early as our first class, Codeup contributed to doubling the number of software developers employed at Geekdom.  \nNurturing New Talent\nOur team is proud to offer GI Bill support, job placement services, top-notch career planning workshops, and a diverse student population. 62% of Codeup students are minorities and 24% are women. Our premier immersive coding program offers a personalized approach to delivering technical coursework and career coaching, which focuses on critical topics like resume writing, career mapping, technical white-boarding, and interviewing skills. We also support our students all the way through job placement! We are so confident in our program that we offer a tuition refund, which ensures that we hold ourselves accountable to delivering a top-notch programming education and effective placement services.\nThe Codeup Founders & Team are passionate about contributing to the growth of the SA Tech Community. Our immersive program is targeted at early career or career transitioning developers that have an appetite for problem solving and learning.  Codeup also partners local startups and small tech businesses to offer an Apprenticeship Program to promote student growth and mentorship.  We are proud to be stewards of the San Antonio Tech Community by providing a top-notch coding education and creating job-ready software developers!\n"}, {"title": "Bootcamp Living Expenses? Codeup's Got You Covered. - Codeup", "content": "\nBootcamp Living Expenses? Codeup’s Got You Covered.\nReady to apply to Codeup? Fill out our online application! It takes 5 min. to complete, there’s no coding experience required, and we help cover your bootcamp living expenses.\nCodeup now helps with your bootcamp living expenses.\nYou’re ready to increase your earning potential. You’re ready to kickstart a fulfilling career as a software developer. But your rent and car payments are keeping you in that dead-end job. Bootcamp living expenses are all too real.\nFear no more, friends. Codeup and Skills Fund have a solution for you.\nA leading career accelerator, Codeup transforms student lives with an outcomes-based software development education. Codeup is proud to partner with Skills Fund to provide access to a diverse set of students. We’re dedicated to removing barriers to your Codeup training and your career.\nAs of August 2016, you can finance your Codeup tuition (minus the deposit), and add up to $6,000 as a living stipend during your program. We’re proud to offer financing under one low, universal interest rate for all approved students – regardless of your credit history or current position in life. Our partnership includes:\n\nLevel playing field for all students \n\nOne universal, fixed interest rate on 3-year and 5-year loan terms\n\n\nNo barriers to starting your immersive program\n\nStipend financing available to cover bootcamp living expenses\n\n\nEmpowered decisions \n\nKnow your interest rate, general APR, and full monthly repayments before you apply\n\n\nInvestment in your future\n\nNo income, employment, nor educational criteria used in underwriting\n\n\nUpfront financing\n\nNo teaser rates, cosigner trickery, nor prepayment penalties\n\n\nCosigner options available – only if you need it\n\nReady to move forward or learn more? Visit our partnership site at Codeup.Skills.Fund today. Be sure to check out the monthly payment calculator. That way, you’ll know your payments before submitting your online application. It only takes minutes to complete.\nReady to apply to Codeup?\nFill out our online application! It takes 5 min. to complete, and there’s no coding experience required.\n"}, {"title": "6 Tips For Picking The Best Coding Bootcamp - Codeup", "content": "\n6 Tips For Picking The Best Coding Bootcamp\nHaving a tough time choosing the best coding bootcamp for you? Not sure whether the bootcamp you’ve just been admitted to is legit?\nWell, you’re in luck!\nAs Codeup‘s admissions director, I speak to dozens of current and prospective students everyday. I’m here to help cut through the noise and share feedback from those students, and help you on your path to picking the best coding bootcamp for you.\nProgram fit and quality are key to launching a successful career as a software developer, and there are six non-negotiables to keep in mind as you make your decision.\n6 Tips For Picking the Best Coding Bootcamp (TL;DR)\n\nLearn from the pros. Be sure you’ll have lots of access to experienced, passionate instructors.\nQuality over quantity. Be wary of schools with lots of campuses. You don’t want to end up at a diploma mill!\nIn-person, not online! Schools with in-person learning environments produce better programmers.\nDo they put their money where their mouth is? Check out the school’s job placement opportunities and/or job guarantee.\nNetworking! Ask about how the school gets students integrated in the local tech community.\nKeep an eye on funding options, especially those from non-profit sources. Even if you don’t qualify for a grant or scholarship, it means the school has been vetted by third parties.\n\n1. Lots of 1:1 Time with Qualified, Experienced Instructors\nWe’ve all dealt with disengaged teachers, but at a good program, you shouldn’t have to. Be sure that there’s a full staff of bona fide instructors that maximize individual attention and mutual accountability.\nLook for three things in your programming instruction: actual work experience in the industry (not just at the bootcamp!), a passion for teaching, and access to one-on-one tutoring.\nCollege computer science courses are heavy on theory, light on useful applications. That’s great for some folks, but a good immersive coding program gives you the tools you need to get a job, and it’s best to learn from people who’ve been using them to build creations of their own. When reviewing instructors’ credentials, look past the fancy degrees and give brownie points for web development jobs and industry savvy.\nWith that in mind, some of the most brilliant software developers simply aren’t the greatest teachers. You want to be sure your instructors love interacting with students, explaining complex concepts to beginners, and offering one-on-one help whenever needed.\nAlso, when possible, be sure to do a campus visit and meet the instructional staff. The program staff should always be open to this.\n2. Fewer Locations = Higher Quality\nAlright, I’ll say it. Be wary of coding schools with multiple campuses. Some bootcamps are decent in one city and terrible in another. It’s much easier for a program to give you quality, individualized attention when the staff and instructors aren’t answering to people in a different time zone.\nThere’s decades of evidence for this. The country’s best universities hunker down in one spot and focus on student success. Money-hungry diploma mills have locations in strip malls from coast-to-coast, some of which are known for high dropout rates and have been banned from recruiting military personnel. As with any decision in higher ed, choosing a focused coding bootcamp makes all the difference.\n3. Immersion\nYou’ve probably heard people compare learning programming to learning spoken languages. There are lots of similarities, but there’s a big one to keep in mind: immersion. Both types of languages are learned best through using the language all day, every day, with other people, for an extended period of time.\nA coding bootcamp worth your time should provide a collaborative environment that immerses you in code. You’ll be able to sharpen your new skills alongside a team of experts and vetted fellow students. Instructors push you to the next level, and when the going gets tough, you can always ask one of your bright classmates—a whole group of bright classmates, in fact!\n4. A Stellar Job Placement Record\nWhat’s the end game of any good coding program? Getting you a well-paid job at a company you like!\nFirst, check out the schools’s job placement rate. If their admissions strategy and teaching are solid, it should be north of 90% over six months. This means they’re accepting students who will succeed as developers, not just anyone who can pay the tuition.\nNext, take a look at the list of companies where alumni take jobs. Are they all funneled into one industry? What’s the ratio of startups to corporations? A diverse set of post-grad placements suggests you’ll learn the programming skills necessary to succeed in any work environment.\nAlso, make sure the school is willing to put its money where its mouth is. Good programs should guarantee you a job in a timely fashion or else give you a significant refund.\nWould you rather start something of your own? Even better! Keep reading below.\n5. Ecosystem, Ecosystem, Ecosystem\nThe tech industry thrives in areas where entrepreneurs, investors, creatives, and developers—i.e., you!—can easily get together and make the magic happen.\nCollaborative workspaces, like Geekdom in San Antonio, allow entrepreneurs to build new business and products together. Notable local tech companies like Rackspace and top-tier startup accelerators are also key indicators of a healthy ecosystem and provide important funding sources for new ventures. Cities with diverse, technology-heavy industries (e.g., healthcare, military, energy, aeronautics, automotive, and advanced manufacturing) also offer a strong commercial base to support tech entrepreneurs and job seekers.\nAs you start to build things, it’s also nice to be in a somewhat smaller ecosystem. Getting in on the ground floor of a growing tech scene gives you access to willing and able mentors. Smaller tech cities also tend to have lower costs of living. A new software engineer often finds it helpful to be a big fish in a friendly, easy-to-navigate pond, where the tech community’s got her back in times of success and failure.\n6. Ample Funding Options\nKeep an eye out for schools with various funding options. Many offer loans that allow students to defer payments until after graduation. That’s a huge plus, but you should also ask about non-profit tuition grants and scholarships. And should you not qualify for these benefits, at least you can rest assured that third parties have vetted your school and its leadership is serious increasing access to education.\nSo…which coding bootcamp is right for you?\nImmersive coding programs can get you started on an exciting new career path. That said, big life transitions aren’t easy. It’s important to find the right program, and we encourage all applicants to vet their options for how well each school teaches and accommodates their students.\nIf you have any questions or comments about Codeup, or anything else, we’d love to hear from you! Please feel free to send an email to info@codeup.com or schedule a phone call. We’ll be in touch shortly.\n"}, {"title": "Open for (Bitcoin) Business - Codeup", "content": "\nOpen for (Bitcoin) Business\nAt Codeup, we guide students through 18 weeks of rigorous curriculum and equip them with a comprehensive understanding of software development. We designed our program to challenge students in a number of areas, but financing is not one of them. That’s why we offer various financial options, enabling students to pay for Codeup with the funding plan that works best for them.\nSince we are always looking to accommodate the needs of our students, we recently added another form of payment to our list of funding options. James Canning, a current student who went through Codeup’s application and on-boarding process from overseas, was able to pay the program fee entirely with bitcoin! Here is what he had to say about the experience:\nI recently started the full-time web development boot camp at Codeup in San Antonio, Texas. Codeup is one of the most comprehensive and best-reviewed developer training programs available. One of the main reasons I chose Codeup is because I was able to pay in bitcoin, the currency in which I receive my income.\nI always ask businesses I might transact with if they accept bitcoin; in the case of Codeup, I included this paragraph when I emailed them to enquire about the course:\n“By the way, if Codeup accepted bitcoin for payments it would be very beneficial for both parties. With a payment processor like Bitpay or Coinbase, Codeup gets instant USDs in its bank account for less than half the fees of credit cards or PayPal with 0 chargebacks and 0 fraud.”\nBecause Codeup does their invoicing through QuickBooks, they easily added the bitcoin payments option with QuickBooks’ excellent PayByCoin feature, which uses Bitpay, the same processor Microsoft, Namecheap, Newegg and others use.\nCodeup emailed me the invoice as normal and I was able to pay the program fee in moments, from anywhere in the world.\nI will post a full review after the course, but so far the boot camp is excellent. Codeup achieves a friendly and supportive atmosphere and is thoroughly integrated into the local tech scene. Over 90% of graduates from the first four classes received job offers in the 6 months following the course. Personally I am not taking the course to get hired but rather to take my site, Bitedge, to the next level.\nIf you want to learn web development and pay in bitcoin, then Codeup is by far the best option. If you use QuickBooks for your invoicing you should enable bitcoin payments!\n\nYou can catch the full version of James’ story here.\n"}, {"title": "A Guide to Hiring Fresh Technical Talent - Codeup", "content": "\nA Guide to Hiring Fresh Technical Talent\nWe’ve watched many employers learn how to hire fresh technical talent since we started Codeup in 2013. Now that many of our grads have 18+ months of work experience, we spoke to employers to determine best practices for hiring Codeup grads. We saw some common themes that can help other employers. Here’s what they said.\nClassical tech interviewing techniques (“Solve this problem without recursion on this whiteboard while we stare at you!”) aren’t always as useful.\n\n“You must understand that this is a junior dev and probably has less than a year of coding experience. You must interview for aptitude and attitude. I usually perform at least 2-3 interviews, starting out with a behavioral interview, then perform a programming and problem solving interview. I usually ask a question that is not solvable (in the allotted time of the interview). I do this on purpose to see how they manage tough problems and difficult situations, from both an intellectual and emotional perspective.”\n“The best practice is always to have the grads interview with different people in the team. Each person assess one specific area of expertise. So we normally have three interviews focus on each of the following aspects:\n\nPersonality and cultural fit (previous projects/jobs, experience, drive, motivation, likes and dislikes, strengths and soft skills)\nCoding Assessment (In this one we try to simulate a work environment in which the interviewer is already part of the team and helps us come up with a feature/solution for a specific customer request. We go over analysis, database design, some white board coding for specific functions and sometimes even GUI design)\nTechnical Assessment. Questions are asked about specific technologies and also we like to focus on their capstone project and what role/part they had during its development. We evaluate how well they can explain their project and the tasks that they performed.”\n\n\n\nHiring fresh talent requires a different mindset and approach to growing a tech organization.\n\n“Early on we put new grads on pet projects – usually something internal that was a contrived project. We quickly discovered that real world projects were a much better starting point. Typically we have them start with writing automated tests, then slowly give them more demanding work as their skill sets develop.”\n“Be honest with yourself about what your needs are and what your company is hiring for. Bootcamp grads need mentorship and time to develop and progress within an organization.”\n\nAn experienced mentor and development plan are essential.\n\n“Understand that you are making an investment. If you make a wise selection and couple that with strong mentorship you can end up with great talent.”\n“Pairing an entry-level developer with more experienced team members has worked well for us. We also like to get our newly graduated developers into real code as soon as possible. There is no better way to learn than solid keyboard time.”\n“What has worked best so far is to get them into support tasks immediately, so they get familiar with the code, the architecture, the product and the customers and the learning curve, although a little more aggressive, is reduced. This way while fixing bugs or doing QA they learn the most complex and hidden parts of our system which triggers the right questions.“\n\nSmart management and hiring approaches still apply.\n\n“Providing a mix of focused assignments within their skills set along with some stretch assignments and mentorship maximizes their development.“\n“Having an onboarding plan is a must with 1 month, 3 month, 6 month targets. Provide the developer with tutorials and find assignments where the tools and knowledge that they have at a particular point will allow them to succeed at completing such assignment. Furthermore, weekly 1:1’s are crucial.”\n“With one of my hires, even though I didn’t feel very strong in their ability, I hired based on attitude with a hope that over time, they would become a better developer. I found that they (again because of their attitude) excelled with customer support, so they found their place there instead of development.”\n\nEntry-level talent can positively impact team attitudes and fulfilment amongst senior staff\n\n“Having entry-level people can be a great way to add energy to a team, and allows more senior developers the opportunity to mentor and teach their craft to others.”\n\nWe’d love to see how we can help your company grow its tech talent pipeline. Let’s talk! \n"}, {"title": "Don't worry - Here's the Best Bootcamp Funding Options! - Codeup", "content": "\nDon’t worry – Here’s the Best Bootcamp Funding Options!\n \nAt Codeup we work to fully service your coding learning experience from the first day you connect with us, until well into your new career. As we see it, our students are courageously jumping into an intensely immersive experience.  We want to give you the tools you need to swim fearlessly, while learning really valuable skills.\nOne tool we find many of our students need is help paying for the Codeup experience. Our home-grown scholarship programs, grant/funding partners, and excellent financing options make it straight-forward and easy. We’ve worked to make sure we have the best partners so that there are no predatory lenders or sketchy unreliable customer service experiences.\nWe are happy to introduce you to our newest partner who can be a helpful funding resource for you. Meet Skills Fund. You’ll like them as much as we do when you see what they have to offer.\nHere’s what they have to say for themselves, in their own words:\n\nA PARTNERSHIP TO INVEST IN YOUR CODEUP EXPERIENCE & SUCCESS\nSkills Fund’s goal is simple: we don’t finance students to attend crappy programs. For this reason, we work daily to build the best financing tools for leading bootcamps and their students.\n\n‣ Fixed interest rates: 8.49% for 36 months; 10.49% for 60 months\n‣ Finance up to $15,000 (tuition – deposit) of program costs\n‣ Interest-only payments while in program and for 60 days following graduation\n‣ Transparent loan terms: understand your interest rate before applying\n‣ 10 minutes to complete your application. Pre-approval within minutes.\n‣ Cosigner options available\n\nCHOOSE WHAT WORKS FOR YOU\nSelect from 3- and 5-year loans, and only pay interest while in-course. Gain the benefit of lower monthly payments during the repayment phase.  Different packages make interest rates workable for you, in terms of duration to pay back the loans and amounts disbursed. For more information on your Skills Fund loan options, please visit the Codeup Skills Fund portal.\nWhat is the advantage of financing and how can I use the money?\nA full cash payment can place unfavorable stress on your savings, and the high Annual Percentage Rate (APR) of a credit card can quickly increase the cost of your education. Financing enables ease of payment, with low, fixed competitive interest rates that can be paid back at anytime without penalty.  You can only use the loan to directly fund your Codeup education. The loan will be disbursed to Codeup within days of starting your course. Bootcamp funding like this makes completing the program hassle-free.\nWill I qualify for a Skills Fund loan or do I need a cosigner?\nAs long as you meet the basic underwriting criteria – you are a U.S. citizen or permanent resident, have no recent bankruptcies and no history of loan default – you’ll most likely qualify for payment for your Codeup experience. You can (1) apply individually, and should you not be approved, you can reapply with a cosigner, or (2) initiate your loan process with a cosigner.\n\n \nSo there you have it!  Don’t worry if these terms sound ultra-complex. We’ll walk through every step with you because that’s our DNA – high touch, high care. We are on your team!  We want funding be an easy part, because upgrading your life and developing your future are worth investing in!\nInterested in learning more? Give us a call at (210) 802-7289 or send us an e-mail at info@codeup.com.\n \n \n"}, {"title": "Startup Week - The little week that could. And did. - Codeup", "content": "\nStartup Week – The little week that could. And did.\nIn case you didn’t know, last week was kind of a big deal. A five-day marathon termed “Startup Week” coursed through our city, leaving a slew of entrepreneurs, students, developers and dreamers inspired in its wake. The jam-packed celebration featured over 55 speakers and 68 free events, and ended up drawing in more than 270 attendees! Not too shabby, San Antonio.\nSo, who’s behind all this magic, anyway?\nAs the chief organizer of SA Startup Week, Vanessa Paige, Operations Manager at the 80/20 Foundation, worked behind the scenes to coordinate the madness and keep things sailing smoothly. For Vanessa, last week was about building San Antonio’s entrepreneurial ecosystem and breaking down its barriers to entry:\n\nThe entire week opened up the door to learn more about starting up a venture – or just learning about an industry or topic of your choice…It gave the public a taste of entrepreneurship and access to the movers and shakers that are directly impacting the ecosystem in downtown SATX.\n\nJob well done, Vanessa!\nAnother key driver of last week’s success were the sponsors and venues that came alongside Vanessa’s efforts and provided a grounds for inspiration and collaboration by opening their doors to the community,. As one such sponsor, we were able to host five events in-house! One of our favorites was a dialogue between community leaders Pat Matthews and Lorenzo Gomez. Just two CEOs engaging in a casual conversation, but with a twist: there was an audience! Bright-eyed listeners came from far and wide, simply to be in the same room as these two passionate visionaries. It. Was. Awesome. And in case you missed it, we put it on YouTube. You can thank us later.\nUntil next year, Startup Week!\n \n"}, {"title": "The Results are in...Codeup Growsup Was a Smashing Success! - Codeup", "content": "\nThe Results are in…Codeup Growsup Was a Smashing Success!\n \nALERT. ALERT. We’ve been feeling all warm-and-fuzzy ever since last Friday, and it won’t stop! Why is this happening?!\nHmm. Oh, yeah…Codeup Growsup was last week! We had the privilege of celebrating our new space with 130 of our nearest and dearest friends. Red carpets were strut upon, glamour shots were taken, libations were consumed, hors d’oeuvres we’re devoured, and much fun was had. In other words, it was a most delightful evening! We’re blown away by the wondrous tech community we get to be a part of here in San Antonio. So here’s a gigantic thank you to everyone who made it out, struck a pose, and strutted their stuff at last Friday’s extravaganza!\n \nWant to see more photos from the event? Hit up our Facebook page!The results are in…Codeup Growsup was a smashing success!\n"}, {"title": "Codeup Helps Rails Girls Help Women Learn to Code in San Antonio - Codeup", "content": "\nCodeup Helps Rails Girls Help Women Learn to Code in San Antonio\nThis moment in history is exploding with stories about women breaking new ground in technology, summits of female tech leaders, and invitations for women to learn new technology skills so that IT teams and development shops can benefit from gender parity. Organizations like Rails Girls are fueling the fire by providing women and girls with the tools and community they need to learn, and to be confident with new coding skills. This week, Rails Girls is putting on a free, two-day workshop in San Antonio where they will teach women how to program using Ruby on Rails.\nAt Codeup, we’re all about community, collaboration, and partnership. It’s our lifeblood to be an integrated force in San Antonio’s landscape of blooming, new tech talent. We also work to fuel the dreams, goals and future potential of women in tech careers. So when we heard about the upcoming Rails Girls workshop, we only had one question, which we managed to sandwich between our fangirl squeals: Can we partner with you?!\n \nThey said yes, we cried tears of joy, and our shared mission has us both super invested in the success of the upcoming workshop. How are we investing? Well, our time, treasure, and talent are the best things we can give! Two of our esteemed team members, an instructor and one of our curriculum developers, as well as our co-founder and his team of developers, will be participating as on-site mentors to help facilitate the learning process. As educators and friends, these folks embody who we are and what we do at Codeup. Here’s their take on the weekend’s programming festivities:\nRyan Orsinger, our full-stack bootcamp instructor, says, “Rails Girls makes a global impact for gender parity in the programming community. Codeup makes an impact for gender parity in the San Antonio programming community.” It’s a perfect match of shared goals!\nRyan goes on to say that his “decision to volunteer as a coach for Rails Girls is simple. Programming is the new literacy, and everyone should have exposure and experience in this field. I’m thrilled that San Antonio will be hosting its first (of many) Rails Girls workshops.”   Agreed, Ryan.\n \n \nNow, meet Tarek Hafez, a curriculum developer here at Codeup:\nTarek is passionate about learning and growing from the challenges he faces, and as a volunteer at Rails Girls he hopes to share his passion and knowledge with others. “I can help to motivate and inspire those I seek to mentor, as well as educate,” said Tarek, “I could not ask for a better opportunity.”\n \nAnother awesome supporter of Rails Girls from our community is Jason Straughan, a Codeup cofounder, our CTO, and founder and head guy in charge of everything at a Grok Interactive, a web application development company. He’s sending his developers to also mentor the event.\n“Louis, Anton, and Joseph and I are going to be coaches for Rails Girls…I’m pumped,” said Josh Freeman, senior software developer and former instructor for Codeup teen summer coding camps. Not only that, Joseph is a also Codeup-grad-turned-Grok-developer! According to Josh, the developers at Grok are never done learning and studying, an ideal that “meshes well with Rails Girls, where you’re trying to train and introduce new people to programming. That’s why we jumped at the opportunity.” Although the Rails Girls workshop will only be in San Antonio for a weekend, the organization has already planted its compelling, and contagious, vision in our city.\nIn our coding bootcamps people come in with dreams, hopes, fears, and wonder. Can I do this? Can I really learn a new set of skills in four months, become a valuable developer, and end up with a completely new job, new life, and new trajectory? And women especially bring a different set of sensitivity and caution. We meet their wise concerns with a great confidence-building foundation of real skills to maximize their value in the tech landscape. Can I really do this? Is there room for me in the 73% tech industry? Can I make a difference?\nGreat questions. And we answer them with a resounding yes because we see it happen again, and again, and again.\n*You may still be able to snag a spot at this weekend’s workshop! Check with railsgirlssa@gmail.com for details.\n\n"}, {"title": "Filling up fast! With good reason. - Codeup", "content": "\nFilling up Fast! With Good Reason.\nThere must be a growing realization that it’s a great idea to make a career transition with the help of a bootcamp. It’s a smart way to make a real change. More and more people are coming to us everyday wanting to learn about the difference between front-end and back-end programming skills, and how they can learn them. At Codeup we teach full-stack development, which is a big deal because it truly equips our grads to be ready and adaptable to convert the skills they learn into our bootcamps into immediately useful tools for the companies that hire them. The are programing language agnostic, and able to think through the best way to solve the problems a developer might face, from a range of perspectives and methods.\nAnd with good reason! Employers want great developer talent, more, now than ever. Codeup has established a clear presence in San Antonio and beyond, with our top-notch super-focused training programs. Learning to code in a coding bootcamp is an intense and life-changing experience.  It takes people who want to accelerate into a new career and builds their skills, language, outlook and capacity to think like a developer in a very compressed timeline. And this method produces measurably great results. Results employers love!  The local business community, both high-tech entrepreneurs and industry-wide larger corporations, know that we are a great resource to help build awesome tech departments, one developer at a time.\nMaybe 2016 is your time to explore your ambitions? To upgrade your options? To get up to shape for your future in a coding bootcamp. We are almost already fully enrolled for our next bootcamp, but do not dismay! As of today you can apply for the next one, which runs from March through June, or the one after that which runs May through September.\nOr call Dylan, because he can help you figure out how to make it happen!  We’d all love to help you get ahead with your life, because it’s in our DNA to help make people more confident and bold and prepared to develop our future!  Our Alumni can tell you all about it!\n"}, {"title": "Codeup and LaunchCode Partner to Help Grads Launch Careers in Coding - Codeup", "content": "\nCodeup and LaunchCode Partner to Help Grads Launch Careers in Coding\nCodeup, meet LaunchCode. LaunchCode, meet Codeup. \nThat’s right…we have a new partner! Codeup has recently joined forces with LaunchCode, a St. Louis-based nonprofit that uses an apprenticeship model to place motivated programmers (i.e. Codeup grads) within a vast network of potential employers. LaunchCode’s employer partner network spans over 300 companies nationwide, ranging from smaller startups to big-name companies like MasterCard, all in need of tech talent. \nAnd that’s where we come in. \nAfter four months of intensive bootcamp immersion, our grads have some serious skills. Thanks to this partnership, our grads will gain access to a world of job placement and paid apprenticeship opportunities so they can put their new skill set into action.\nOur bootcamps are a nontraditional, effective way to learn to code. Many companies already recognize and benefit from the value of bootcamp grads, but some are still unsure of how to best integrate them into a team. One thing that makes LaunchCode an ideal partner for us is that their model creates opportunities for driven programmers, regardless of whether or not they have traditional credentials. And this model is working: over 90% of LaunchCode’s apprenticeships are converted to full-time hires within 90 days.\nYou may be thinking “But Codeup, don’t you already have a stellar hiring rate?” \nTo which we reply: Staaaahp. We’re blushing. But to answer your question, yes. While 94% of our graduates find work within 6 months, we are always aiming to increase opportunities for students post bootcamp. Before the partnership, we were working within a network of 64 partner employers, many of which are based here in San Antonio. By teaming up with LaunchCode, we’re expanding our connections beyond San Antonio, so our grads will be able to find their dream jobs not just locally, but across the nation! Pretty neat.\n"}, {"title": "Press Release: Free Learn to Code Bootcamp for Veterans and Transitioning Servicemembers Launches In-Class Portion - Codeup", "content": "\nPress Release: Free Learn to Code Bootcamp for Veterans and Transitioning Servicemembers Launches In-Class Portion\nNew, Free Learn to Code Bootcamp for Veterans and Transitioning Servicemembers Launches In-Class Portion Today\nProgram Is First of Its Kind In Texas\nSan Antonio, TX – Today, a group of Veterans and Transitioning Servicemembers will start a whole new kind of “bootcamp” in San Antonio, TX, trading pushups and pullups for computers and code. Modeled after Codeup’s successful learn-to-code programs, Veteran Bootcamp will train students for careers as professional computer programmers, but with a twist: it’s free. \nThe bootcamp is entirely funded through a contract from the U.S. Department of Veterans Affairs, awarded to Coley, who partnered with Codeup to provide this valuable training to Veterans and Transitioning Servicemembers. Veteran Bootcamp is part of the Veterans Economic Communities Initiative, which fosters education and employment opportunities for Veterans at the community level. Qualified students can participate in the bootcamp at no cost, without using GI Bill benefits. \nVeteran Bootcamp is a 250+ hour program taken part-time over 16 weeks at Codeup’s campus in downtown San Antonio. Students have completed pre-work remotely and will begin in-class training this evening, focusing on front-end technologies like JavaScript, HTML, WordPress, and CSS. Graduates will be prepared for jobs as entry-level front-end web developers and software engineers.\nAccording to Computerworld, IT jobs are expected to grow at 22 percent annually through 2020. “There’s clearly a huge gap between the skills in our workforce and the needs of employers,” said Michael Girdley, CEO of Codeup. “We’re proud to be part of this solution, especially with San Antonio’s role as Military City USA.”\nAt a glance:\n\n18 in the first cohort, 5 of whom relocated to San Antonio\nAligns with the White House’s Skills and Demand-Driven Training Initiative designed to train more Veterans and Transitioning Servicemembers with job skills needed by industry\nOver 200 applied for this bootcamp nationwide\n\nAbout Codeup: Codeup is a computer programming bootcamp in San Antonio, TX with a mission to change people’s lives by helping them launch careers in tech. Founded in 2013, Codeup has generated more than $3 million in new tech salaries since its inception with a hiring rate over 93 percent.\nAbout Coley: Coley & Associates, Inc. is a VA-Certified Service Disabled Veteran Owned, Small Business (SDVOSB) delivering world-class training and performance solutions that empower the workforce.\n"}, {"title": "What The SA Tech Job Fair Says About San Antonio - Codeup", "content": "\nWhat The SA Tech Job Fair Says About San Antonio\n \nLast night, Codeup co-hosted the first San Antonio Tech Job Fair at the Geekdom Event Centre. By the numbers, it was a great success:\n\n500 RSVPs for job seekers.\nBiggest event ever at the Geekdom Event Centre.\nDozens of employers recruiting. Names like Accenture, Codeup, Def-Logix, H-E-B, Labatt Food Service, Rackspace, USAA, and WP Engine.\n\nThe great news for San Antonio is that young people are indeed looking to tech careers as a path to build a rewarding future. At the same time, it’s clear that we need to do more to get those young people ready to succeed in the tech workforce.\nI personally spoke to over a hundred job seekers, and my booth-mate Dylan did, too.\nWe talked with dozens of recent computer science grads of local colleges and universities. They wanted entry-level jobs, but when I asked, “What have you built that is real?”, they pointed to toy applications and homework assignments. The students succeeded in their coursework – the curriculum simply didn’t arm them with applied, job-ready skills.\nWe also spoke to employers and saw which jobs the employers were looking to fill. All of the recruiters were targeting senior and mid-level technical positions. The big company employers were searching for the same.\nIt’s clear that San Antonio is getting good at producing entry-level talent, but we still have a huge gap in technical ability. The main takeaway after talking to both job seekers and job givers is that the San Antonio workforce isn’t where tech employers want it to be. It’s the responsibility of both the educators and the employers to become much more involved in solving that problem.\nMoving forward, there are two challenges for us as a community. First, educational programs (including Codeup) need to continue to evolve and guide talent beyond entry-level skills. Second, companies need to take talent development seriously to grow more senior talent out of these young people.\nWe’re working on the problem. It’s time other parts of the community stepped up as well.\n"}, {"title": "Why Choose Codeup? - Codeup", "content": "\nWhy Choose Codeup?\nProspective students sometimes ask about how we compare to other coding education models. We think choosing Codeup should be a no-brainer.\nHere’s why we’re widely considered one of the top coding bootcamps in the world:\nOur Students: We put our students success first (and our student testimonials reflect this!) From study hall hours to professional development workshops, we ensure our students are ready for hire as an entry-level developer as soon as they graduate.\nBusiness Partnerships: We are proud to work with over 100 employer partners. We make sure to continue our conversations with our employer partners to see what their hiring needs are. Our curriculum is based off of what the current hiring needs are in the tech industry.\nTuition Refund Guarantee: Codeup is the only coding bootcamp that returns half of your tuition if you don’t find work within 6 months.\nOur Craftsmanship: You’ll see the owners of our company regularly onsite, making certain that what we do is top-tier. We’re not the remote office of a large company.\nHeart of Downtown: Codeup loves being located in the heart of downtown, where the tight-knit tech community is. You’ll know what we mean when you join us.\nIf you’re interested in learning more about Codeup, we’d love for you to visit our campus in downtown San Antonio. If you’re from out of town, no problem – we’re more than happy to answer your questions over the phone at (210) 802-7289 or contact us here!\n"}, {"title": "Use Your Texas Unemployment Benefits at Codeup - Codeup", "content": "\nUse Your Texas Unemployment Benefits at Codeup\nEligible applicants can now use Texas Workforce Development funds to help pay for a bootcamp to become a professional software developer. Codeup is the first coding bootcamp in Texas to accept Workforce Improvement Act (WIA) benefits which are dedicated to helping adult and dislocated workers prepare for meaningful careers in a variety of targeted occupations. Software and web developers rank near the top of this list, in regards to average hourly wage.\nThe first step is to find out if you’re eligible for funding by contacting our local workforce board, Workforce Solutions Alamo. Transitioning Servicemembers may qualify for funding as “dislocated workers.”\nWith any questions, drop us a line at info@codeup.com or (210) 802-7289.\n"}, {"title": "Q&A with Luis Martinez, Director of Entrepreneurship at Trinity University - Codeup", "content": "\nQ&A with Luis Martinez, Director of Entrepreneurship at Trinity University\nDr. Luis Martinez, Director of the Center for Innovation and Entrepreneurship at Trinity University, visited the Codeup classroom to talk to our students about entrepreneurship. Below is a Q&A from the end of his presentation.\nHow do you differentiate between proof of concept, prototype, minimum viable product, and customer validation when coaching students?\nThe first thing to ask is, “what’s the true value proposition?”. So, “what’s the ‘it’ that’s really going to be valuable?”. The second questions is, “who is the customer?”. You really need to understand your customer better than they understand him or herself. That means talking to customers, that means working with customers, that means actually going to people and saying, “look I have this idea what do you think?”. So define the true value proposition you’re trying to provide, and then match that with real customers and real customer needs.\nThen the second step, once you make that connection and validate that value proposition with a customer match, is actually getting the “it” in front of somebody, or a version of the “it” in front of somebody to be able to sense whether or not it’s really going to be viable.\nInvestors love you, but they love paying customers best. So between you and the investor, there’s the prototype, there’s the app that helps convince them there really is a path forward and not just some guys who’s nice to talk to but has nothing to offer.\nHave you begun to see more entrepreneurial models and educational approaches in high schools or middle schools across the United States?\nThere’s a lot of stuff going on right now in high schools and middle schools, who are just beginning [entrepreneurship].  Venture Labs, which is just down the street [from Codeup], is doing some really great work in trying to put that into the curriculum. I don’t know if it’s a fad or if it will be here permanently, but we are seeing a lot more of it. We’re also seeing a lot more young college students getting involved in entrepreneurship.\nWhat do you think about crowdsourcing platforms as a means of defining value proposition and finding customers and funding?\nI love crowdsourcing and crowdfunding, I think it’s a great way of determining whether your thing is the upcoming thing that people wanna buy. The problem with crowdsourcing is that there’s just a lot of crap out there and there’s a lot of people who are not only selling you something, but a whole bunch of stuff that you’re not gonna get. So it’s great if you’re doing it for real and using it for the right reasons.\nFrom the inventor/startup side, it’s a phenomenal way of being able to say, “we have 5,000 people who want to buy our special sauce and so now we’ve taken that money we’re gonna go bottle that sauce.” But I urge you all to think about what the next thing is going to be. What’s after crowdsourcing? We’re already seeing a variety of that with equity crowdfunding, but is there something else that can be the next thing? When we think about the principles of crowdfunding, is there an opportunity to leapfrog and go just above that curve of innovation to be the first entrant, or occupy that first niche that does something differently?\nIf your startup idea is an adaptation or modernization (a faster wheel, so to speak) of an earlier product, does the process of developing that idea change?\nIt’s still the same, but it makes selling it easier. It’s like, “Facebook for cats,” like, “Sea World without large mammals,” like, “Uber, but for boats.” It’s easier to sell; there’s a higher likelihood that you know who your customer are, because there are people using it already.\nThe challenge is that some of the big companies are already thinking about those things and they have chosen not to pursue them for various reasons. The good news for startups is that maybe the reasons corporate companies chose not to pursue are the exact reasons why you should choose to pursue them as a startup: because they’re too big, too bureaucratic to understand the real opportunity, or they chose to pass on it.\nBe careful with an idea that’s similar to what other people are doing. Do your due diligence. Sometimes the patent literature is in the library and you can thumb through and see there was this old company that had that same idea 20 years ago, who then got bought out, and got bought, and got bought out, and no one ever did anything with it. Now if you just tweak that idea–by taking what they did and marrying it with the cloud, marrying it with crowdsourcing, marrying it with an app platform, social media–you will then be able to see the right opportunity. If those guys are still around, it might be worth finding them and asking, “whatever happened to that?”.\nElevator pitch versus Ted Talk?\nYou will need different pitches for different audiences at different times, so have them all ready. You should have your 10 second elevator pitch, your 2 sentence explanation of what you do, your 3 minute pitch, your Ted Talk; you should have a deck for an investors with appendices, a deck for sales to sell your thing. There are different kinds of ways of presenting for different kinds of audiences; have all of those presentations relatively polished so when that opportunity presents itself, you can pitch it right then. Be ready.\nStart with outlining the technically detailed way to say what you’re trying to say to other engineers, computer scientists, people who are in the field who do and see the need and will be able to make the thing that  you need to make. Then, think of the 35,000-foot big-picture version of what you’re trying to say, and sort of in between those is the rest of the world.\n"}, {"title": "Exploring New Domains: ICANN's gTLD Program - Codeup", "content": "\nExploring New Domains: ICANN’s gTLD Program\n \nThe Internet Corporation for Assigned Names and Numbers (ICANN), a non-profit organization responsible for maintaining the global Domain Name System (DNS), is in the middle of rolling out its new gTLD program, which has the potential to reshape how users find information on the internet and how organizations build their identities online.\nKevin Kopas, Channel Manager for Radix Registry, stopped by the Codeup classroom to help students better understand the gTLD program and how it may transform the domain industry over the next few years.\nWhat is a domain, anyway?\nDomains are identifiers that create spaces of authority within the internet. A domain reflects an Internet Protocol address (IP address), which links to the server where a website is hosted.  Domains are organized according to a hierarchical model consisting of top-level, second-level, and lower-level domains.\nTop-level domains (TLDs) constitute the highest level of domains in the DNS. There are many types of TLDs–including country codes like .us, .uk, and .jp–and Generic Top-Level Domains (gTLDs), such as .com, .info, .edu, and .org. gTLDs are operated and managed by registries, like Radix.\nSecond and lower-level domains directly follow TLDs and are located to the left of the “.” in a domain. For a visual, in the domain “codeup20.wpengine.com,”  “.com”  is the gTLD and “codeup” is the second-level domain. Typically, registries delegate the responsibility of allotting domain names to registrars, such as GoDaddy.\nHow is the domain industry changing?\nUntil recently, the list of gTLDs was limited to traditional strings, like the previously-mentioned .com and .net, as well as .gov, .mil, .org. and .edu. Over the years, the number of desirable and available second and third-level domains associated with these gTLDs has become increasingly scarce.\nTo diversify the pool of available domains, ICANN is in the process of introducing 1300+ new gTLDs. These include everything from .baby, .mls, .dot,  and .realty, to .sucks, and .buy. Radix has acquired eight new gTLDs, including .space, and .website, and will soon be offering .tech.\nRegistries can apply for a new gTLD through ICANN. In the case that multiple registries apply for the same gTLD, those companies partake in an auction to determine the winner. ICANN runs its own auction to solve these contention sets; however, companies have found ways to resolve these disputes before reaching ICANN through private auctions like Applicant Auction, which have their own rules and regulations. Sometimes companies even negotiate deals on their own instead of conducting a private auction.\nThe winning price for each gTLD varies. Registries often play a high-stakes guessing game where big prices have the potential for big returns. For example, on the low end of the March 2015 ICANN auction  , .srl was purchased for $400,000; on the high end, Google purchased .app for $25 million.\nWhat does this mean for the web?\nIn Kopas’ opinion, slowly but surely, the .coms and .nets of the world will become overpowered by more specific gTLDs. While the impending end of the .com era may be sad for some, this shift also opens up new opportunity for creativity and specificity in a company’s branding and marketing.\nWith a more diverse list of available gTLDS, companies can better align their web presences with their products or services: a beauty salon could use .salon or an independent realtor could use .realtor. On the flip side, users will be able to tailor their searches based on a company’s gTLD. This change also has the potential to offer credibility to businesses in certain industries. For example, in order to obtain a .law domain, the applicant must be a licensed practitioner.\nBut will these new gTLDs ever really become the norm? Will Google’s $25 million investment in .app produce a sizable ROI? Only time will tell. In order for this shift to happen, consumers must understand the industry and recognize the new variety of available gTLDs. Thanks to Kopas, Codeup students are now “in the know” about the changing domain of domains!\nFor more info on the upcoming gTLD changes, check out ICANN’s FAQ page.\nTo hear about how applicants plan to use the new gTLDs, watch ICANN’s video series.\n"}, {"title": "Using Git as a Communication Tool - Codeup", "content": "\nUsing Git as a Communication Tool\nAs Josh Freeman of Grok Interactive shared with our students during a lunchtime talk, it’s extremely important to maintain quality communication when working on a project.\nGit, while primarily a tool for version control, can be used to facilitate this kind of interaction. Freeman recommends two simple steps to maximize communication in Git.\n1. Use the Git commit as an opportunity to increase communication by explaining the changes you make to your code, as opposed to explaining it in a comment.\nSet up a Git commit template, or a standardized layout for commit messages. Freeman’s template is listed below. Don’t forget, your commit message summary must be 50 characters or less; all other lines should be under 72 characters.\n(Configuring your Git commit template)\nExample Git Commit Template:\n2. Organize your commits logically.\nSections of code that don’t relate to each other shouldn’t be committed together. Instead, break your code into logical sections and commit each section separately.\nYou can accomplish this by adding to the index in patches, which allows you to stage parts of files and provides finer control over what you commit. Maintaining an organization to your commits will make it much easier to communicate via the commit template.\n(Adding to the index in patches)\nFollowing these two simple Git guidelines can prevent frustration that arises when deciphering code. Communication is key not only for your current team members, but also for your future self or future developers who may inherit your code sometime down the line.\n"}, {"title": "The Delorean Gets a Ride - Codeup", "content": "\nThe Delorean Gets a Ride\nOur beloved Delorean took a ride in the tow truck today. Once it’s back from the shop, life will be complete again. Cross your fingers!\n \n \n"}, {"title": "6 SEO Tips From SEO Guru, Matt Egan - Codeup", "content": "\n6 SEO Tips From SEO Guru, Matt Egan\nLast Thursday, Matt Egan, founder of San Antonio-based Search Engine Optimization agency, Image Freedom, spoke to our Full-Stack Bootcamp students during our weekly lunchtime talk series. Read on for six SEO takeaways from his presentation.\n1. Make your title tag effective.\nThe title tag, or the text written on the tab of your website, is a huge factor in your SEO ranking and should be as simple and straightforward as possible. The title tag is not the place for creative metaphors or puns: if your website is about finding cheap flights, the word “cheap flights” should most definitely be in your title tag.\n2. Keep your key words simple and specific.\nLikewise, the keywords you choose to emphasize on your website–especially the keywords within the first block of content on the homepage–should convey your purpose as concisely and simply as possible.\n3. “Don’t half-ass two things, whole-ass one thing.”\nBorrowing from the wisdom of Parks and Rec’s Ron Swanson, this quote means you should avoid spreading the same keywords across multiple pages on your site. Decide early on which keywords you want on each page and stick to it. If you need to reuse a keyword on a separate page, you can always put it in an image (which Google can’t read) or link it back to the original page where the keyword is emphasized.\n4. Don’t use “click here” on your website.\nNever use the words, “click here” on your website to direct users to links or documents. “Click here” has been used so frequently to link to Adobe PDFs that, when you Google it, Adobe Reader is the first or second item listed. Using “click here” can actually hurt your SEO. Instead, use a link title that describes the content to which it’s linking.\nExample:\n“For more information about Codeup’s Teen SummerCamp, click here.” = WRONG!\n“Learn more about Codeup’s Teen SummerCamp.” = RIGHT!\n5. Make shareable content.\nShareable content, like a free brochure or infographic, can increase the amount of people linking to your site. When it comes to SEO, quality links are golden. You want as many quality links as you can get!\n6. Ensure your site is mobile-friendly.\nGoogle is changing their algorithm (again) to factor in a site’s mobile-friendliness. This change is set to be released during the week of April 21st, 2015. If you want to maximize your SEO (and minimize mobile users’ frustration when browsing your site), you must ensure that your website uses responsive design. Not sure if your site is responsive? Use Google’s free mobile friendliness test to find out.\n"}, {"title": "What is the Value of a Codeup Education? - Codeup", "content": "\nWhat is the Value of a Codeup Education?\nThis is a guest article by Michael Taylor, originally posted at The Rivard Report and Bankers Anonymous.\n \nLike many, I see education from a combination of angles. Unquestionably, education makes us broader thinkers and more sparkling conversationalists. Education makes us more actualized humans.\nBut as a finance guy, a small evil part of me always applies the $64,000 Wall Street question to every activity – from brushing my teeth to tossing a ball with a (in my case, non-existent) dog. [1] It’s the bottom-line question: “How is this making me money, like, right now?” [2]\nOne of the problems of education, generally, is that we have a hard time proving or quantifying its value. What is the value of holding your shoulders back and head high when you walk into a job interview, knowing you’re the best they’re going to interview that week? Or the value of the feeling, when given a work assignment, of “Boom! I got this!”\nPhilosophically, how can you put a value on just knowing more stuff?\nCODEUP\nThe weird thing about my friend Michael Girdley – who started the computer coding school Codeup – is that he’s ambitious enough to say that the education community tradition of waving a hand at hard-to-measure fuzzy feelings is not good enough. Just because the education community finds it difficult to measure value doesn’t mean that business people shouldn’t try.\nIn less than two years he’s established a pattern of tracking data on the most important finance question of education. By that, I mean the bottom-line question: How is this making me money, like, right now? Girdley shared with me the pre-Codeup and post-Codeup earnings of his students, along with some useful stats on entry-level and mid-career web developer salaries.\nUsing a couple of his statistics, I want to take a stab at figuring out the total value, right now, of a student’s investment in Codeup.\nSTATISTIC #1:\n“The average Codeup graduate saw her annual salary jump $13,035 in the year after graduation from the program.”\nWhat does that really mean? What can you do with that number if you plan, say, 30 working years at this higher salary?\nIt would be great to say that a Codeup education is worth 30 times $13,035, or $391,050. However, money in the future is not as valuable to me as money today, so that calculation is not quite accurate. I mean, you could figure it, but finance guys will give you the time value of money speech that you don’t want to hear again.\nWith a salary increase of just $13,035, we can calculate what that amount is worth today by using a discounted cashflow formula. So let’s be sophisticated and apply our discounted cashflow formula to 30 years of earnings, elevated by $13,035.\nI have to assume a “discount rate,” which is some combination of taking into account inflation and future investment risks. I’m going to assume a 5% discount rate. [3] Using my 5% discount rate, I estimate the value today of my elevated salary to be $200,379.90. That’s the sum of 30 years’ worth of $13,035, but “discounted,” or translated back, into today’s dollars.\nThat discounting allows us to more accurately compare the $16,000 tuition for Codeup with the total financial value, today, of that education. By that measure, you pay Codeup $16K today for something worth on average, $200K, today. [4] Another way of putting it is that you are buying something today worth 12.5 times that amount. With these numbers, Codeup sounds like pretty good deal. \nSTATISTIC #2:\n“The average web developer, nationally, earns $91,750. That’s $61,525 more than the average pre-Codeup salary of surveyed Codeup students.”\nSo that’s interesting.\nWe can imagine a number of reasons for this difference which don’t have to do with the value of Codeup. Maybe the average web developer is older and more experienced on the job than the average pre-Codeup student. Maybe national salaries are higher than San Antonio salaries, on average.\nI mean, I’m sure they are.\nBut still. If one of your goals is to swim in a higher-paid talent pool, it might pay to learn the butterfly stroke.\nHow much would 15 peak years of earning $61,525 more than you earn now be worth, like, right now? Again, I don’t think it’s as high as 15 times $61,525, or $922,875, because of the whole discounted cashflow of money in the future not being worth as much money today. Also, to be fair, you probably won’t earn the average national salary until you had a few years to ramp up your career.\nBut what about discounting 15 years of an additional $61,525 per year, at a 5% rate, starting 5 years from now, using the exact same formula that we used before? [5] Discounting those 15 years of earning the average industry salary gives me a value, today, of $500,366.44. Which, to state the obvious, is 31X the price of tuition.\nWith those kinds of numbers I start to feel like that sales guy from Entourage: “What if I was to tell you that you’d pay $16,000 tuition to Codeup for something worth $500K today? Is that something you might be interested in?”\nLook, seriously, there are a lot of assumptions embedded in my statement that “you could pay $16K in tuition today for future salary jumps worth $500K, today.”\nMost important of these is the assumption that, by training as a programmer, you can earn the national average salary for programming jobs. And we all know there’s no guarantee that happens.\nBut – and this is a big but [6] – it’s not a crazy assumption. Because, really, it’s an assumption that the average happens.\nIt’s an assumption that you could be paid what other people in your industry are generally paid. It’s an assumption that markets are somewhat efficient.  It’s an assumption that, if you have valuable skills, you can find employers and work situations just like other people.\nAll of which makes me pretty confident that the financial return on a skills upgrade like Codeup can be somewhere between 12 and 31 times the upfront tuition cost.\nBACK TO THE VALUE OF AN EDUCATION\nAs I said before, education leads to more sparkling conversations as well as to a more fully actualized life. Of that, I have no doubt.\nBut I appreciate my friend Girdley’s business-like approach to showing that the value of his program can be somewhere between a 12 and 31 times multiple of your investment. Just thinking like a finance guy, is that something you might be interested in?\n——–\n[1] Notice I haven’t gotten a dog because – I ask you – where’s the profit in that?\n[2] I’m still working on monetizing my teeth-brushing.\n[3] How did I come up with 5%? Sorta kinda I used art in addition to science. You could call inflation 2%, so that’s a baseline for discounting the value of money in the future. Then there’s the future risk of actually earning the elevated salary, which after all is a big assumption, and also an average, and as we always say in finance ‘results may vary, past performance is no predictor of future results, etc,’ so there’s a few % points added to the inflation rate to account for that kind of risk. If you don’t like my 5% assumption, make your own, I can’t promise you I’m “right” about a 5% discount rate. You might be just as right with a different assumption. Also, remember the faux philosopher and native San Antonian Jack Handey is a good guide to these disagreements: “Instead of having ‘answers’ on a math test, they should just call them ‘impressions,’ and if you got a different ‘impression,’ so what, can’t we all be brothers?”\n[4] In addition to the $16K tuition of course you have to do a lot of work to not only learn to code, but also, you know, earn a salary in the future. So there’s still that whole ‘work’ problem. But if you have to work, it’s nice for the finance part to at least make sense, no?\n[5] Why did I choose 15 years and not 30 this time? Mostly because I don’t think it’s fair to assume a Codeup graduate’s salary jumps immediately to the average national salary. You work up to that. For that same reason, I calculated the value with a 5 year delay, to account for a slow ramp-up. Again, Jack Handey comes to mind: “If you ever teach a yodeling class, probably the hardest thing is to keep the students from just trying to yodel right off. You see, we build to that.”\n[6] Hhhnn-huh. Heh. (Shut up, Beevis.)\n\n"}, {"title": "Demo Day Summary - Codeup", "content": "\nDemo Day Summary\n \nDemo Day at our new space in Geekdom’s Event Centre was a success! Read on for a recap of Codeup students’ final projects.\nMy Garage Sale\nKevin Bongiovanni, Nicole DeBord, Felice Malaszowski\nMy Garage Sale offers a promotional platform for home garage sales. Hosts can create seamless sale pages and avid “pickers” can browse local listings quickly and conveniently.\nThe app was built using the Laravel framework, PHP, MySQL, JavaScript, jQuery, CSS3, HTML5, Twitter Bootstrap, and the Google Maps API. Version control was handled with GitHub. My Garage Sale also features tagging systems and image uploads.\nInsureJoy\n \nChris Fuhrman, Travis French, Marissa Vega\nInsureJoy takes the hassle out of buying life insurance. Users can browse life insurance policies without overwhelming and pushy insurance agents, using simple, clear, and transparent price comparisons.\nThis web app was built using Laravel, PHP, MySQL, JavaScript, jQuery, Twitter Bootstrap, and Dropzone.js. InsureJoy also features user logins, an admin/company dashboard, profile/user dashboard, 3rd party integration, and contact messaging. Version control was completed using Git and GitHub.\nRover Sleepover\n \nCalvin Glover, Michael Gudowski, Stephanie Riera\nRover Sleepover creates a space for four-legged friends within the growing sharing economy. An “Airbnb for dogs,” the site connects dog owners with dog lovers who understand the stress of finding a safe place for a “Rover” to stay over when his/her owner goes out of town.\nRover Sleepover uses the Laravel framework, Google Maps API, PHP, MySQL, jQuery, HTML and CSS to create a simple user interface application for both users and hosts.\nServe Search\n \nJeff Brown, Paul Love, David Runnels\nServe Search was built with the idea that serving one’s community and making the world a better place should be easy. The app applies the approach of on-demand movies, one-click shopping, and the convenience of the “get it now” culture to volunteering with community organizations.\nServe Search was built using, Laravel, PHP, MySQL, JavaScript, jQuery, and Bootstrap. Development was done in the Vagrant environment and version control was completed with Git and GitHub. The site was designed mobile first and is fully responsive.\nInterested in hiring a Codeup grad?  Check out grad profiles on our nifty alumni portal!\n"}, {"title": "Advice for Programmers - Codeup", "content": "\nAdvice for Programmers\nAs our most recent cohort flies the coop, they leave us with a plethora of wise words for aspiring and experienced programmers alike:\n“Work together as much as possible.”\n“When you’re stuck on something, don’t be afraid to walk away, take a break, and come back.”\n“Read the documentation.”\n“Everything builds on the foundation.”\n“Ask questions! Don’t be afraid to ask questions.”\n“Ask questions even if you think you’ve got it!”\n“Take advantage of all the resources available to you.”\n“This is all about cooperative and collaborative learning.”\n“Accept the confusion. It’s all part of the process.”\n“Break everything! Break your code! It’s a great way to learn how things work and how to fix stuff. Don’t be afraid to break things.”\n“Leave good comments in your code. You’ll thank yourself later.”\n“Working together starts with getting to know each other.”\nWhat are some words of wisdom you’ve gathered from the workplace? Share by commenting below. \n"}, {"title": "Coding Bootcamps Should Publish Verifiable Results - Codeup", "content": "\nCoding Bootcamps Should Publish Verifiable Results\n \nIf you’re going to promise things to customers, you should back it up with detailed data. Want to know if an educational program is working? Ask for data about individual students and their outcome. If a program, college or school isn’t willing to provide that — run the other way.\nWhen we started Codeup, Chris, Jason and I decided to question conventional thinking about education. While the common practice is to withhold real, verifiable data about outcomes, we decided we should be open about results so our applicants can make educated decisions.\nWe do just that here.\n23 out of 27 from our May class are working. Our August class just finished up and is out finding early success in the job market.\nCome see us. We think you’ll be blown away.\nMichael\n"}, {"title": "Learning to Code vs Learning to Build - Codeup", "content": "\nIn creating Codeup, we interviewed a lot of people, and we discovered an ugly truth: there are tons of ways out there to learn to code. However, there are few that would teach you how to apply your newfound knowledge. People would tell us: “I went through Codeacademy or a CS program at college and I can’t make anything.”\nAs we talked to employers, we confirmed this ugly truth: tons of people can “code” but few can actually build anything. Why, we asked, do employers only want to hire people with 3+ years experience? That’s because classical education opportunities are clearly not teaching people how to build real stuff.\nSo, for Codeup, we built a program designed not to teach people “how to code” but instead “how to build.” At each stage of the course, the emphasis is on building stuff: a blog using framework, a jQuery game, command line applications, and then a Capstone Project that is representative of a real-world, production application.\nIf you want to be employable, learn to build stuff using code. That’s what we’re all about.\n"}, {"title": "Front-end vs Back-end - Codeup", "content": "\nWe can differentiate between front-end and back-end development easily by understanding that web designers focus on the design, typography, colors, etc. (front-end development), while web programmers focus on back-end development using specific languages (MySQL, PHP, other database languages, etc). Front-end = what you see; back-end = how it works.\nFront-end\nThese days, front-end development refers to the part of the web users interact with. In the past, web development consisted of people who worked with Photoshop and those who could code HTML and CSS. Now, developers need a handle of programs like Photoshop and coding in not only in HTML and CSS, but also JavaScript or jQuery (a compiled library of JavaScript).\nWebsites combine HTML, CSS, and JavaScript, all controlled by the browser. For example, if you use Google Chrome or Firefox, the browser translates all of the code in a manner for you to see and interact with, such as fonts, colors, drop-down menus, sliders, forms, etc. In order for all of this to work, though, something has to support the front-end; here the backend comes into play.\nBack-end\nIn a previous blog, we talked about how web programmers are concerned with launching websites, updates, and maintenance, among other things. All of that works to support the front-end of the website. The back-end has three parts to it: server, application, and database.\nTo better explain, let’s use the example of a customer trying to purchase a plane ticket using a website. Everything that the customer sees on the webpage is the front-end. However, once the customer enters all of their information (ie. their name, billing address, destination, etc), the web application stores the information in a database that was created previously on the server where the website is calling for information.\nThe web application creates, deletes, changes, renames, etc items in the database. For example, when a customer purchases a ticket, that creates an item in the database, but when they change their order or they wish to cancel, they change the item in the database.\nA server, in the simplest form, is a computer accessed remotely that runs software to fulfill requests from clients. In our example, the server the customer’s browser is communicating with is where the database is stored and modified.\nWhen a customer wants to buy a ticket, the backend operation web application communicates with the server to make a change in a database stored on said server. Backend programmers use technologies like Java, PHP, Ruby, Python, and others to make this communication work smoothly, allowing the customer to purchase his or her ticket with ease.\nWhat’s your preference?\nMany of these technologies relate to eachother. They all work together to make something work. Some developers can program for both front-end and back-end. However, it takes much more time to design while programming the back-end. It all depends on the project and what technologies and skills are needed where.\nWhich do you prefer? Does front-end development with HTML, CSS, and JavaScript interest you more? Or do you see yourself as a back-end champion tackling technologies like PHP, Python, and Ruby? Whichever your choice, you can learn how to use these programming languages in Codeup. Our classes focus on Java and client-side JavaScript; This leaves room for our graduates to decide whether they would like to pursue front-end or back-end development.\nFor the next blog, we will talk about being a full stack developer and what that entails.\nInterested in learning in becoming a software developer? Give us a call at (210) 802-7289 or contact us here!\n"}, {"title": "Why Colleges Suck at Making Programmers - Codeup", "content": "\nWhen creating Codeup, we went out and talked to lots of people in the tech industry both on the employer and employee side. One thing became very clear: colleges are doing a terrible job producing programmers.\nHere’s what we found out:\nProgramming isn’t fun  \nUndergrad computer science has changed little since the late 1990s when I was in school. One thing that hasn’t changed is the high weed-out rate of students in CS. According to a study out of the Helsinki University of Technology, Finland, between 30 and 50% of CS majors drop out and switch to other majors during their first intro to CS course. The number one reason: lack of motivation. Colleges don’t make CS fun, and that’s a tragedy.\nCollege takes a long time\nMany people went back to school hoping to become developers.  In the case of an associate’s program, it take 2 years or more. A classic college education is four years. You do not want to know about how much it costs (click here to find out).\nCollege includes things that aren’t necessary to do a programming job\nDoes one really need a full liberal arts degree with electives to be employable? As the recent crops of college graduates have demonstrated, a college degree doesn’t mean a future.\nLectures are a terrible way to learn coding\nThink of programming like learning a new spoken language. Is that best done sitting in classroom or being on the streets of a foreign country talking with the locals? The same thing goes for college where the lecture format still dominates.\nColleges teach what they can sell\nColleges sell degrees, not futures.  If a college had to guarantee a future to its graduates, would they offer so many degrees that produce people with no useful skills?\nProfessors (often) teach what interests them\nFor those of us who took a class from a research professor, we discovered quickly that our semester long class would be 20% quickly going through course materials and an 80% deep dive on the professor’s personal research interests. It’s great that the professor thinks that pandas are a majestic animal, but the class is Biology, not endangered species 101.\nCollege is slow to keep up\nIn tech, things move incredibly fast. Here’s the problem with college development: departments start planning their offerings several years before the student is taught the information. By that time, it’s likely the real world has changed so much that the student is being taught information from 3 or 4 years ago. In visiting some CS departments, I have heard from students that their professors were teaching languages that went out of real-world usage decades ago.\nSo, STEM education is broken. Schools need to align their interests with those of the students. Schools need to make tech accessible. Schools need to put students first, rather than treat them as customers. Students should finish with a future and not a mountain of debt. And so on. Things need to change.\nWe think there’s a better answer, and we’ve designed it. If schools sold you an education but not a future, we have the answer. Applications are open at Codeup.com.\n"}, {"title": "Why Do Lawyers Get Paid the Big Money? - Codeup", "content": "\nLawyers are compensated extremely well for the work that they do, but why is their pay so high, $250 per hour and beyond?\nThree reasons: 1) They have a skill with limited supply of people that can do it, 2) the difference between a mediocre and good lawyer is really apparent, and 3) they work on really important stuff (i.e., when people hire a lawyer, the job needs to be done right).\nSound familiar? This why programmers get paid so well, too.\n1) Limited supply of people\nEven in our very own San Antonio, TX, there just are not enough programmers to meet the demand that employers have. They often have to look elsewhere in order to find people to fulfill their technology needs. A lot of programmers who are also homegrown here in San Antonio leave the city in order to find jobs elsewhere because they are not aware of all of the opportunity that lies here.  The United States is even giving foreign people with computer science backgrounds work visas to live in the US and offer their skills. Looking for a career in which you will always be needed? This is it.\n2) The difference between good and bad are apparent\nAny lawyer that tells you that a case is “a slam dunk” is a bad lawyer. Any lawyer that stumbles and fumbles through the law as if he or she were riding a unicycle on a rocky road is an awful lawyer. Any programmer that builds apps full of bugs and that crash every time you open them and calls it a finished product is a bad programmer. It is easy to tell the difference between something that is good and something that is awful, especially with computer programming. You know something is good when the program is doing what it is meant to do without issues. It feels flawless, which means a lot of hard work went into building it. However, like the examples above, bad lawyers and programming are quite apparent. Would you use Facebook as much if it worked like MySpace when MySpace was popular? Chances are you would not.\n3) They work on important things\nLook at your smartphone or tablet and think about all of the apps you use on a daily basis. Then, look at your laptop or desktop computer and think about all of the things you use those for. Now, look at your job and all of the software and technology necessary to keep you afloat, aware, and productive. Chances are that you rely heavily on technology on a day-to-day basis, and a lot of it is important for our lives, personally and professionally. Computer programmers, among others, are the people behind a lot of the things we take for granted every day. They work on important things, and they need to be paid well for it. You would not want to pay as little as possible for an architect to design your family’s home; why would you want a computer programmer to be paid very little to make your life much more frustrating with buggy and incomplete software?\nThese are just three simple reasons why computer programmers, like lawyers, get paid a lot of money. It’s really about what they do and who they do it for.\nRight now is the best time to learn how to become a computer programmer and start getting paid well for doing important things. If you’d like to learn more about how you can get the most out this profession, apply for Codeup and let’s talk!\n"}, {"title": "The College Financing Scam and How We're Doing Things Differently - Codeup", "content": "\nHere’s the dirty secret of private college “financing” and how it really works. Private colleges first set a ridiculously high list price. Here’s my alma mater Lafayette College as an example. Their all-in cost per year now is $57,000 (food not included, sorry).\nHere’s the secret: most everyone doesn’t pay nearly that much. They get “financial aid.” The financial aid office studies each family’s finances, tax returns, and background and then uses a formula to determine financial aid and grants. In other words, they look to see the maximum that a family can afford and charge that amount.\nTo repeat: colleges study how much you can possibly afford and then set the price for you. This is like a car dealer looking at your tax return and deciding how much you should pay for a car. That’s wrong.\nOf course, the department that looks at financial aid is a cost center for the school. Colleges have to hire financial aid assistants, governmental compliance managers, debt collectors, managers to manage the managers, and so on. Therefore, tuition has to be higher to pay for more staff to handle the amount of loans, aid, and financing that must be arranged. It’s a vicious cycle.\nFor most colleges, the price that you pay is not only for the cost of your classes. You pay for everything else that the college has to offer, even if you do not use all of their services, such as their sports teams, gyms, luxury dormitories, etc. The rising cost of college is also affected by administrators with bloated salaries and inefficient spending, but not teacher salaries. For example, 42 college presidents made over $1 million in compensation in 2012. Additionally, many universities are having to spend millions on trying to attract more students to apply because they have to compete for students on a global scale.\nThe result of this process is that the parents and students are forced to take out student loans that will take decades to pay off. We know tons of people who are saddled with student debt in their late 30s and early 40s.\nYoung people graduate with tons of debt and no guarantee of a future. Is that the way education should work? We think that’s garbage.\nPeople ask if they can use government grants, conventional student loans, GI Bills, and other public or private financing sources. We say no because we don’t want to punish our students because the higher education system is fundamentally broken. If we join other educational institutions exploiting students and government funding, we’ll slowly become the bureaucratic mess they have become. Instead, we want to spend our time working to prepare our students.\nWe think that higher-education needs a complete rethinking. Education should be tied to a future, not to a slip of paper. If an educational program wins while students lose, that is a failed institution and system.\nWith Codeup, you get what you pay for. We put our money where our mouth is. We do not ask for government handouts. We do not saddle students with any debt until we get them a future. You win, we win. You lose, we lose.\nStudents first, always, and that is how it should be.\n"}, {"title": "Why People Can't Learn Programming on Their Own - Codeup", "content": "\nWhile developing Codeup, we interviewed dozens of people who attempted to learn programming on their own. We wanted to delve into their experience to uncover lessons learned.  We discovered the self-taught method was done with good intentions but the result was unfortunately failure. Here are some of the reasons it didn’t work out.\n1.  Beginning point\nOur interviewees really didn’t know where to start. The topic of technology is huge, so determining a beginning point was difficult. Most people don’t know what to learn first. One person told us she started with Java, a popular programming language. Although it’s widely used, it’s difficult to learn. I know because I wrote four books on it.\n2.  Online resources suck\nComputers and online lessons stink at teaching anything complex. If you can’t understand a topic, your only option for clarification is to have the online resource explain it to you again the exact same way. That doesn’t work at advancing your knowledge. What is beneficial to your learning is having a live instructor understand your thought process so that he/she can customize the instruction for you. In programming, concepts build on one another. For each concept you learn, the preceding topic must be understood. If you’re missing a core concept, you won’t understand the next one.\n3.  Lack of focus\nComputer programming is intense. We discovered that people lose their focus because the topic is not easily absorbed. It takes time to learn and practice programming, a big investment that some are not willing to make long-term. Some think they can learn it within a weekend or at night, but that approach only sets them up for failure. Another reason people lose their focus is because life gets in the way.\n4.  Single minded\nOne is a lonely number when you’re learning on your own. Lessons learned in solitude are not beneficial because there is only one perspective — yours.  People get more out of instruction when they learn in groups – the one thing the current education system gets right.  Peers within groups motivate others to perform better.  Having individuals as part of a group instantly creates a community where everyone is traveling the same journey.\n5.  Reasons to learn\nFor most people, learning programming had no clear endpoint. They had difficulty envisioning life after the lesson. Do I really get a job? Am I building something meaningful? Having invested a lot of time and energy on programming, people started to question “Why am I doing this?”\nThe Codeup model addresses these issues in a learning system we’ve developed into a single, intense 9-week boot camp with live instructors. Students finish with a Hiring Day where they demonstrate a live, production ready application to show prospective employers.\nWe want to teach you about programming, so you can put this skill to work to improve your life and those of others. Are you ready to step into the future?\n"}]